### :seedling: Terragrunt Plan (env: **dev**)
**Status**: success
**Log**: [📦 terragrunt-plan log](https://github.com/kuma0128/terraform-openmetadata-aws-assets/actions/runs/15920377980/artifacts/3416865224)

<details><summary>Show plan output</summary>

```terraform
07:08:09.741 INFO   The stack at . will be processed in the following order for command plan:%0AGroup 1%0A- Module ./cicd%0A%0AGroup 2%0A- Module ./backend%0A%0AGroup 3%0A- Module ./dns%0A%0AGroup 4%0A- Module ./aws%0A%0A%0A07:08:09.876 INFO   [cicd] Downloading Terraform configurations from ../../../.. into ./cicd/.terragrunt-cache/7oFB538NYgmiYb4lrqzjelB2WgI/vxdbUoFBPPcfo8ey7QUdnvPtOeY%0A07:08:10.628 INFO   [cicd] terraform: Initializing the backend...%0A07:08:12.133 INFO   [cicd] terraform: %0A07:08:12.133 INFO   [cicd] terraform: Successfully configured the backend "s3"! Terraform will automatically%0A07:08:12.133 INFO   [cicd] terraform: use this backend unless the backend configuration changes.%0A07:08:12.486 INFO   [cicd] terraform: Initializing modules...%0A07:08:12.487 INFO   [cicd] terraform: - iam_github_oidc in ../../../modules/cicd/iam_github_oidc%0A07:08:12.487 INFO   [cicd] terraform: Initializing provider plugins...%0A07:08:12.487 INFO   [cicd] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...%0A07:08:12.545 INFO   [cicd] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...%0A07:08:12.557 INFO   [cicd] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...%0A07:08:12.586 INFO   [cicd] terraform: - Finding latest version of hashicorp/tls...%0A07:08:12.697 INFO   [cicd] terraform: - Installing hashicorp/aws v6.0.0...%0A07:08:16.728 INFO   [cicd] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)%0A07:08:16.866 INFO   [cicd] terraform: - Installing hashicorp/tls v4.1.0...%0A07:08:17.075 INFO   [cicd] terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)%0A07:08:17.178 INFO   [cicd] terraform: - Installing hashicorp/http v3.5.0...%0A07:08:17.397 INFO   [cicd] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)%0A07:08:17.534 INFO   [cicd] terraform: - Installing hashicorp/random v3.7.2...%0A07:08:17.691 INFO   [cicd] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)%0A07:08:17.691 INFO   [cicd] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider%0A07:08:17.691 INFO   [cicd] terraform: selections it made above. Include this file in your version control repository%0A07:08:17.691 INFO   [cicd] terraform: so that Terraform can guarantee to make the same selections by default when%0A07:08:17.692 INFO   [cicd] terraform: you run "terraform init" in the future.%0A07:08:17.692 INFO   [cicd] terraform: Terraform has been successfully initialized!%0A07:08:17.695 INFO   [cicd] Executing hook: fmt%0A07:08:17.718 INFO   [cicd] Executing hook: validate%0ASuccess! The configuration is valid.%0A%0A07:08:23.924 STDOUT [cicd] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Reading...%0A07:08:23.960 STDOUT [cicd] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0A07:08:23.966 STDOUT [cicd] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Reading...%0A07:08:24.010 STDOUT [cicd] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]%0A07:08:24.841 STDOUT [cicd] terraform: Terraform used the selected providers to generate the following execution%0A07:08:24.841 STDOUT [cicd] terraform: plan. Resource actions are indicated with the following symbols:%0A07:08:24.841 STDOUT [cicd] terraform:   + create%0A07:08:24.841 STDOUT [cicd] terraform: Terraform will perform the following actions:%0A07:08:24.841 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_openid_connect_provider.this will be created%0A07:08:24.841 STDOUT [cicd] terraform:   + resource "aws_iam_openid_connect_provider" "this" {%0A07:08:24.841 STDOUT [cicd] terraform:       + arn             = (known after apply)%0A07:08:24.842 STDOUT [cicd] terraform:       + client_id_list  = [%0A07:08:24.842 STDOUT [cicd] terraform:           + "sts.amazonaws.com",%0A07:08:24.842 STDOUT [cicd] terraform:         ]%0A07:08:24.842 STDOUT [cicd] terraform:       + id              = (known after apply)%0A07:08:24.842 STDOUT [cicd] terraform:       + tags_all        = (known after apply)%0A07:08:24.842 STDOUT [cicd] terraform:       + thumbprint_list = [%0A07:08:24.842 STDOUT [cicd] terraform:           + "2b18947a6a9fc7764fd8b5fb18a863b0c6dac24f",%0A07:08:24.842 STDOUT [cicd] terraform:           + "dd55b4520291e276588f0dd02fafd83a7368e0fa",%0A07:08:24.842 STDOUT [cicd] terraform:           + "7560d6f40fa55195f740ee2b1b7c0b4836cbe103",%0A07:08:24.842 STDOUT [cicd] terraform:         ]%0A07:08:24.842 STDOUT [cicd] terraform:       + url             = "https://token.actions.githubusercontent.com"%0A07:08:24.842 STDOUT [cicd] terraform:     }%0A07:08:24.842 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_role.this will be created%0A07:08:24.842 STDOUT [cicd] terraform:   + resource "aws_iam_role" "this" {%0A07:08:24.842 STDOUT [cicd] terraform:       + arn                   = (known after apply)%0A07:08:24.842 STDOUT [cicd] terraform:       + assume_role_policy    = (known after apply)%0A07:08:24.842 STDOUT [cicd] terraform:       + create_date           = (known after apply)%0A07:08:24.842 STDOUT [cicd] terraform:       + force_detach_policies = false%0A07:08:24.842 STDOUT [cicd] terraform:       + id                    = (known after apply)%0A07:08:24.842 STDOUT [cicd] terraform:       + managed_policy_arns   = (known after apply)%0A07:08:24.842 STDOUT [cicd] terraform:       + max_session_duration  = 3600%0A07:08:24.843 STDOUT [cicd] terraform:       + name                  = "ethan-dev-iamrole-apne1-oidc"%0A07:08:24.843 STDOUT [cicd] terraform:       + name_prefix           = (known after apply)%0A07:08:24.843 STDOUT [cicd] terraform:       + path                  = "/"%0A07:08:24.843 STDOUT [cicd] terraform:       + tags_all              = (known after apply)%0A07:08:24.843 STDOUT [cicd] terraform:       + unique_id             = (known after apply)%0A07:08:24.843 STDOUT [cicd] terraform:       + inline_policy (known after apply)%0A07:08:24.843 STDOUT [cicd] terraform:     }%0A07:08:24.843 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_role_policy_attachment.this will be created%0A07:08:24.843 STDOUT [cicd] terraform:   + resource "aws_iam_role_policy_attachment" "this" {%0A07:08:24.843 STDOUT [cicd] terraform:       + id         = (known after apply)%0A07:08:24.843 STDOUT [cicd] terraform:       + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A07:08:24.843 STDOUT [cicd] terraform:       + role       = "ethan-dev-iamrole-apne1-oidc"%0A07:08:24.843 STDOUT [cicd] terraform:     }%0A07:08:24.843 STDOUT [cicd] terraform: Plan: 3 to add, 0 to change, 0 to destroy.%0A07:08:24.843 STDOUT [cicd] terraform: %0A07:08:24.853 INFO   [backend] Downloading Terraform configurations from ../../../.. into ./backend/.terragrunt-cache/rvEkBg4Vb_7nn5A0z9rn3-n7wJc/vxdbUoFBPPcfo8ey7QUdnvPtOeY%0A07:08:25.542 INFO   [backend] terraform: Initializing the backend...%0A07:08:27.045 INFO   [backend] terraform: %0A07:08:27.045 INFO   [backend] terraform: Successfully configured the backend "s3"! Terraform will automatically%0A07:08:27.045 INFO   [backend] terraform: use this backend unless the backend configuration changes.%0A07:08:27.389 INFO   [backend] terraform: Initializing modules...%0A07:08:27.390 INFO   [backend] terraform: - backend in ../../../modules/backend%0A07:08:27.391 INFO   [backend] terraform: Initializing provider plugins...%0A07:08:27.391 INFO   [backend] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...%0A07:08:27.463 INFO   [backend] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...%0A07:08:27.531 INFO   [backend] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...%0A07:08:27.640 INFO   [backend] terraform: - Installing hashicorp/random v3.7.2...%0A07:08:27.822 INFO   [backend] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)%0A07:08:27.864 INFO   [backend] terraform: - Installing hashicorp/aws v6.0.0...%0A07:08:33.087 INFO   [backend] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)%0A07:08:33.179 INFO   [backend] terraform: - Installing hashicorp/http v3.5.0...%0A07:08:33.363 INFO   [backend] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)%0A07:08:33.363 INFO   [backend] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider%0A07:08:33.364 INFO   [backend] terraform: selections it made above. Include this file in your version control repository%0A07:08:33.364 INFO   [backend] terraform: so that Terraform can guarantee to make the same selections by default when%0A07:08:33.364 INFO   [backend] terraform: you run "terraform init" in the future.%0A07:08:33.364 INFO   [backend] terraform: Terraform has been successfully initialized!%0A07:08:33.367 INFO   [backend] Executing hook: fmt%0A07:08:33.390 INFO   [backend] Executing hook: validate%0ASuccess! The configuration is valid.%0A%0A07:08:40.091 STDOUT [backend] terraform: module.backend.data.aws_s3_bucket.this: Reading...%0A07:08:41.125 STDOUT [backend] terraform: module.backend.data.aws_s3_bucket.this: Read complete after 1s [id=ethan-s3-apne1-tfstate]%0A07:08:41.255 STDOUT [backend] terraform: Terraform used the selected providers to generate the following execution%0A07:08:41.255 STDOUT [backend] terraform: plan. Resource actions are indicated with the following symbols:%0A07:08:41.256 STDOUT [backend] terraform:   + create%0A07:08:41.256 STDOUT [backend] terraform: Terraform will perform the following actions:%0A07:08:41.256 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_policy.this will be created%0A07:08:41.256 STDOUT [backend] terraform:   + resource "aws_s3_bucket_policy" "this" {%0A07:08:41.256 STDOUT [backend] terraform:       + bucket = "ethan-s3-apne1-tfstate"%0A07:08:41.256 STDOUT [backend] terraform:       + id     = (known after apply)%0A07:08:41.256 STDOUT [backend] terraform:       + policy = jsonencode(%0A07:08:41.256 STDOUT [backend] terraform:             {%0A07:08:41.256 STDOUT [backend] terraform:               + Statement = [%0A07:08:41.256 STDOUT [backend] terraform:                   + {%0A07:08:41.256 STDOUT [backend] terraform:                       + Action    = "s3:*"%0A07:08:41.256 STDOUT [backend] terraform:                       + Condition = {%0A07:08:41.256 STDOUT [backend] terraform:                           + NotIpAddress    = {%0A07:08:41.257 STDOUT [backend] terraform:                               + "aws:SourceIp" = [%0A07:08:41.257 STDOUT [backend] terraform:                                   + "192.0.2.0/24",%0A07:08:41.257 STDOUT [backend] terraform:                                 ]%0A07:08:41.257 STDOUT [backend] terraform:                             }%0A07:08:41.257 STDOUT [backend] terraform:                           + StringNotEquals = {%0A07:08:41.257 STDOUT [backend] terraform:                               + "aws:SourceVpce" = []%0A07:08:41.257 STDOUT [backend] terraform:                             }%0A07:08:41.257 STDOUT [backend] terraform:                           + StringNotLike   = {%0A07:08:41.257 STDOUT [backend] terraform:                               + "aws:userid" = []%0A07:08:41.257 STDOUT [backend] terraform:                             }%0A07:08:41.257 STDOUT [backend] terraform:                         }%0A07:08:41.257 STDOUT [backend] terraform:                       + Effect    = "Deny"%0A07:08:41.257 STDOUT [backend] terraform:                       + Principal = "*"%0A07:08:41.257 STDOUT [backend] terraform:                       + Resource  = [%0A07:08:41.257 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",%0A07:08:41.257 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",%0A07:08:41.257 STDOUT [backend] terraform:                         ]%0A07:08:41.257 STDOUT [backend] terraform:                     },%0A07:08:41.257 STDOUT [backend] terraform:                   + {%0A07:08:41.257 STDOUT [backend] terraform:                       + Action    = "s3:*"%0A07:08:41.258 STDOUT [backend] terraform:                       + Condition = {%0A07:08:41.258 STDOUT [backend] terraform:                           + NumericLessThan = {%0A07:08:41.258 STDOUT [backend] terraform:                               + "s3:TlsVersion" = "1.2"%0A07:08:41.258 STDOUT [backend] terraform:                             }%0A07:08:41.258 STDOUT [backend] terraform:                         }%0A07:08:41.258 STDOUT [backend] terraform:                       + Effect    = "Deny"%0A07:08:41.258 STDOUT [backend] terraform:                       + Principal = "*"%0A07:08:41.258 STDOUT [backend] terraform:                       + Resource  = [%0A07:08:41.258 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",%0A07:08:41.258 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",%0A07:08:41.258 STDOUT [backend] terraform:                         ]%0A07:08:41.258 STDOUT [backend] terraform:                       + Sid       = "EnforceTLSv12orHigher"%0A07:08:41.258 STDOUT [backend] terraform:                     },%0A07:08:41.258 STDOUT [backend] terraform:                   + {%0A07:08:41.258 STDOUT [backend] terraform:                       + Action    = "s3:*"%0A07:08:41.258 STDOUT [backend] terraform:                       + Condition = {%0A07:08:41.258 STDOUT [backend] terraform:                           + Bool = {%0A07:08:41.258 STDOUT [backend] terraform:                               + "aws:SecureTransport" = "false"%0A07:08:41.258 STDOUT [backend] terraform:                             }%0A07:08:41.258 STDOUT [backend] terraform:                         }%0A07:08:41.258 STDOUT [backend] terraform:                       + Effect    = "Deny"%0A07:08:41.259 STDOUT [backend] terraform:                       + Principal = "*"%0A07:08:41.259 STDOUT [backend] terraform:                       + Resource  = [%0A07:08:41.259 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",%0A07:08:41.259 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",%0A07:08:41.259 STDOUT [backend] terraform:                         ]%0A07:08:41.259 STDOUT [backend] terraform:                       + Sid       = "AllowSSLRequestsOnly"%0A07:08:41.259 STDOUT [backend] terraform:                     },%0A07:08:41.259 STDOUT [backend] terraform:                 ]%0A07:08:41.259 STDOUT [backend] terraform:               + Version   = "2012-10-17"%0A07:08:41.259 STDOUT [backend] terraform:             }%0A07:08:41.259 STDOUT [backend] terraform:         )%0A07:08:41.259 STDOUT [backend] terraform:       + region = "ap-northeast-1"%0A07:08:41.260 STDOUT [backend] terraform:     }%0A07:08:41.260 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_public_access_block.this will be created%0A07:08:41.260 STDOUT [backend] terraform:   + resource "aws_s3_bucket_public_access_block" "this" {%0A07:08:41.260 STDOUT [backend] terraform:       + block_public_acls       = true%0A07:08:41.260 STDOUT [backend] terraform:       + block_public_policy     = true%0A07:08:41.260 STDOUT [backend] terraform:       + bucket                  = "ethan-s3-apne1-tfstate"%0A07:08:41.260 STDOUT [backend] terraform:       + id                      = (known after apply)%0A07:08:41.260 STDOUT [backend] terraform:       + ignore_public_acls      = true%0A07:08:41.260 STDOUT [backend] terraform:       + region                  = "ap-northeast-1"%0A07:08:41.260 STDOUT [backend] terraform:       + restrict_public_buckets = true%0A07:08:41.260 STDOUT [backend] terraform:     }%0A07:08:41.260 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_versioning.this will be created%0A07:08:41.261 STDOUT [backend] terraform:   + resource "aws_s3_bucket_versioning" "this" {%0A07:08:41.261 STDOUT [backend] terraform:       + bucket = "ethan-s3-apne1-tfstate"%0A07:08:41.261 STDOUT [backend] terraform:       + id     = (known after apply)%0A07:08:41.261 STDOUT [backend] terraform:       + region = "ap-northeast-1"%0A07:08:41.261 STDOUT [backend] terraform:       + versioning_configuration {%0A07:08:41.261 STDOUT [backend] terraform:           + mfa_delete = (known after apply)%0A07:08:41.261 STDOUT [backend] terraform:           + status     = "Enabled"%0A07:08:41.261 STDOUT [backend] terraform:         }%0A07:08:41.261 STDOUT [backend] terraform:     }%0A07:08:41.261 STDOUT [backend] terraform: Plan: 3 to add, 0 to change, 0 to destroy.%0A07:08:41.261 STDOUT [backend] terraform: %0A07:08:41.271 INFO   [dns] Downloading Terraform configurations from ../../../.. into ./dns/.terragrunt-cache/hDrtp-7Ba5Z25zOxXCGdNmDj3r8/vxdbUoFBPPcfo8ey7QUdnvPtOeY%0A07:08:41.989 INFO   [dns] terraform: Initializing the backend...%0A07:08:43.490 INFO   [dns] terraform: %0A07:08:43.491 INFO   [dns] terraform: Successfully configured the backend "s3"! Terraform will automatically%0A07:08:43.491 INFO   [dns] terraform: use this backend unless the backend configuration changes.%0A07:08:43.842 INFO   [dns] terraform: Initializing modules...%0A07:08:43.843 INFO   [dns] terraform: - dns in ../../../modules/aws/dns%0A07:08:43.844 INFO   [dns] terraform: Initializing provider plugins...%0A07:08:43.844 INFO   [dns] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...%0A07:08:43.939 INFO   [dns] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...%0A07:08:43.995 INFO   [dns] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...%0A07:08:44.127 INFO   [dns] terraform: - Installing hashicorp/random v3.7.2...%0A07:08:44.292 INFO   [dns] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)%0A07:08:44.391 INFO   [dns] terraform: - Installing hashicorp/aws v6.0.0...%0A07:08:49.691 INFO   [dns] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)%0A07:08:49.781 INFO   [dns] terraform: - Installing hashicorp/http v3.5.0...%0A07:08:49.964 INFO   [dns] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)%0A07:08:49.964 INFO   [dns] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider%0A07:08:49.964 INFO   [dns] terraform: selections it made above. Include this file in your version control repository%0A07:08:49.964 INFO   [dns] terraform: so that Terraform can guarantee to make the same selections by default when%0A07:08:49.964 INFO   [dns] terraform: you run "terraform init" in the future.%0A07:08:49.965 INFO   [dns] terraform: Terraform has been successfully initialized!%0A07:08:49.968 INFO   [dns] Executing hook: fmt%0A07:08:49.991 INFO   [dns] Executing hook: validate%0ASuccess! The configuration is valid.%0A%0A07:08:56.690 STDOUT [dns] terraform: Terraform used the selected providers to generate the following execution%0A07:08:56.690 STDOUT [dns] terraform: plan. Resource actions are indicated with the following symbols:%0A07:08:56.690 STDOUT [dns] terraform:   + create%0A07:08:56.690 STDOUT [dns] terraform:  %3C= read (data resources)%0A07:08:56.690 STDOUT [dns] terraform: Terraform will perform the following actions:%0A07:08:56.690 STDOUT [dns] terraform:   # module.dns.data.aws_iam_policy_document.route53_query will be read during apply%0A07:08:56.690 STDOUT [dns] terraform:   # (config refers to values not yet known)%0A07:08:56.690 STDOUT [dns] terraform:  %3C= data "aws_iam_policy_document" "route53_query" {%0A07:08:56.690 STDOUT [dns] terraform:       + id            = (known after apply)%0A07:08:56.691 STDOUT [dns] terraform:       + json          = (known after apply)%0A07:08:56.691 STDOUT [dns] terraform:       + minified_json = (known after apply)%0A07:08:56.691 STDOUT [dns] terraform:       + statement {%0A07:08:56.691 STDOUT [dns] terraform:           + actions   = [%0A07:08:56.691 STDOUT [dns] terraform:               + "logs:CreateLogStream",%0A07:08:56.691 STDOUT [dns] terraform:               + "logs:PutLogEvents",%0A07:08:56.691 STDOUT [dns] terraform:             ]%0A07:08:56.691 STDOUT [dns] terraform:           + resources = [%0A07:08:56.691 STDOUT [dns] terraform:               + (known after apply),%0A07:08:56.691 STDOUT [dns] terraform:             ]%0A07:08:56.691 STDOUT [dns] terraform:           + principals {%0A07:08:56.691 STDOUT [dns] terraform:               + identifiers = [%0A07:08:56.691 STDOUT [dns] terraform:                   + "route53.amazonaws.com",%0A07:08:56.691 STDOUT [dns] terraform:                 ]%0A07:08:56.691 STDOUT [dns] terraform:               + type        = "Service"%0A07:08:56.691 STDOUT [dns] terraform:             }%0A07:08:56.691 STDOUT [dns] terraform:         }%0A07:08:56.691 STDOUT [dns] terraform:     }%0A07:08:56.691 STDOUT [dns] terraform:   # module.dns.aws_acm_certificate.cert will be created%0A07:08:56.691 STDOUT [dns] terraform:   + resource "aws_acm_certificate" "cert" {%0A07:08:56.691 STDOUT [dns] terraform:       + arn                       = (known after apply)%0A07:08:56.691 STDOUT [dns] terraform:       + domain_name               = "ethan-example.com"%0A07:08:56.691 STDOUT [dns] terraform:       + domain_validation_options = [%0A07:08:56.691 STDOUT [dns] terraform:           + {%0A07:08:56.692 STDOUT [dns] terraform:               + domain_name           = "ethan-example.com"%0A07:08:56.692 STDOUT [dns] terraform:               + resource_record_name  = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:               + resource_record_type  = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:               + resource_record_value = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:             },%0A07:08:56.692 STDOUT [dns] terraform:         ]%0A07:08:56.692 STDOUT [dns] terraform:       + id                        = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:       + key_algorithm             = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:       + not_after                 = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:       + not_before                = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:       + pending_renewal           = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:       + region                    = "ap-northeast-1"%0A07:08:56.692 STDOUT [dns] terraform:       + renewal_eligibility       = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:       + renewal_summary           = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:       + status                    = (known after apply)%0A07:08:56.692 STDOUT [dns] terraform:       + subject_alternative_names = [%0A07:08:56.692 STDOUT [dns] terraform:           + "ethan-example.com",%0A07:08:56.692 STDOUT [dns] terraform:         ]%0A07:08:56.692 STDOUT [dns] terraform:       + tags                      = {%0A07:08:56.692 STDOUT [dns] terraform:           + "Name" = "ethan-dev-acm-apne1-cert"%0A07:08:56.692 STDOUT [dns] terraform:         }%0A07:08:56.693 STDOUT [dns] terraform:       + tags_all                  = {%0A07:08:56.693 STDOUT [dns] terraform:           + "Name" = "ethan-dev-acm-apne1-cert"%0A07:08:56.693 STDOUT [dns] terraform:         }%0A07:08:56.693 STDOUT [dns] terraform:       + type                      = (known after apply)%0A07:08:56.693 STDOUT [dns] terraform:       + validation_emails         = (known after apply)%0A07:08:56.693 STDOUT [dns] terraform:       + validation_method         = "DNS"%0A07:08:56.693 STDOUT [dns] terraform:       + options (known after apply)%0A07:08:56.693 STDOUT [dns] terraform:     }%0A07:08:56.693 STDOUT [dns] terraform:   # module.dns.aws_cloudwatch_log_group.route53_query will be created%0A07:08:56.693 STDOUT [dns] terraform:   + resource "aws_cloudwatch_log_group" "route53_query" {%0A07:08:56.693 STDOUT [dns] terraform:       + arn               = (known after apply)%0A07:08:56.693 STDOUT [dns] terraform:       + id                = (known after apply)%0A07:08:56.693 STDOUT [dns] terraform:       + log_group_class   = (known after apply)%0A07:08:56.693 STDOUT [dns] terraform:       + name              = "/aws/route53/query"%0A07:08:56.693 STDOUT [dns] terraform:       + name_prefix       = (known after apply)%0A07:08:56.693 STDOUT [dns] terraform:       + region            = "ap-northeast-1"%0A07:08:56.693 STDOUT [dns] terraform:       + retention_in_days = 30%0A07:08:56.693 STDOUT [dns] terraform:       + skip_destroy      = false%0A07:08:56.693 STDOUT [dns] terraform:       + tags_all          = (known after apply)%0A07:08:56.693 STDOUT [dns] terraform:     }%0A07:08:56.693 STDOUT [dns] terraform:   # module.dns.aws_cloudwatch_log_resource_policy.route53_query will be created%0A07:08:56.693 STDOUT [dns] terraform:   + resource "aws_cloudwatch_log_resource_policy" "route53_query" {%0A07:08:56.694 STDOUT [dns] terraform:       + id              = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + policy_document = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + policy_name     = "ethan-dev-route53-query"%0A07:08:56.694 STDOUT [dns] terraform:       + region          = "ap-northeast-1"%0A07:08:56.694 STDOUT [dns] terraform:     }%0A07:08:56.694 STDOUT [dns] terraform:   # module.dns.aws_route53_query_log.route53_query will be created%0A07:08:56.694 STDOUT [dns] terraform:   + resource "aws_route53_query_log" "route53_query" {%0A07:08:56.694 STDOUT [dns] terraform:       + arn                      = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + cloudwatch_log_group_arn = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + id                       = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + zone_id                  = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:     }%0A07:08:56.694 STDOUT [dns] terraform:   # module.dns.aws_route53_record.cert_validation["ethan-example.com"] will be created%0A07:08:56.694 STDOUT [dns] terraform:   + resource "aws_route53_record" "cert_validation" {%0A07:08:56.694 STDOUT [dns] terraform:       + allow_overwrite = true%0A07:08:56.694 STDOUT [dns] terraform:       + fqdn            = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + id              = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + name            = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + records         = (known after apply)%0A07:08:56.694 STDOUT [dns] terraform:       + ttl             = 60%0A07:08:56.694 STDOUT [dns] terraform:       + type            = (known after apply)%0A07:08:56.695 STDOUT [dns] terraform:       + zone_id         = (known after apply)%0A07:08:56.695 STDOUT [dns] terraform:     }%0A07:08:56.695 STDOUT [dns] terraform:   # module.dns.aws_route53_zone.openmetadata_zone will be created%0A07:08:56.695 STDOUT [dns] terraform:   + resource "aws_route53_zone" "openmetadata_zone" {%0A07:08:56.695 STDOUT [dns] terraform:       + arn                 = (known after apply)%0A07:08:56.695 STDOUT [dns] terraform:       + comment             = "Managed by Terraform"%0A07:08:56.695 STDOUT [dns] terraform:       + force_destroy       = false%0A07:08:56.695 STDOUT [dns] terraform:       + id                  = (known after apply)%0A07:08:56.695 STDOUT [dns] terraform:       + name                = "ethan-example.com"%0A07:08:56.695 STDOUT [dns] terraform:       + name_servers        = (known after apply)%0A07:08:56.695 STDOUT [dns] terraform:       + primary_name_server = (known after apply)%0A07:08:56.695 STDOUT [dns] terraform:       + tags                = {%0A07:08:56.695 STDOUT [dns] terraform:           + "Name" = "ethan-dev-dns-apne1-openmetadata"%0A07:08:56.695 STDOUT [dns] terraform:         }%0A07:08:56.695 STDOUT [dns] terraform:       + tags_all            = {%0A07:08:56.695 STDOUT [dns] terraform:           + "Name" = "ethan-dev-dns-apne1-openmetadata"%0A07:08:56.695 STDOUT [dns] terraform:         }%0A07:08:56.695 STDOUT [dns] terraform:       + zone_id             = (known after apply)%0A07:08:56.695 STDOUT [dns] terraform:     }%0A07:08:56.695 STDOUT [dns] terraform: Plan: 6 to add, 0 to change, 0 to destroy.%0A07:08:56.695 STDOUT [dns] terraform: %0A07:08:56.695 STDOUT [dns] terraform: Changes to Outputs:%0A07:08:56.695 STDOUT [dns] terraform:   + cert_arn             = (known after apply)%0A07:08:56.696 STDOUT [dns] terraform:   + domain_name          = "ethan-example.com"%0A07:08:56.696 STDOUT [dns] terraform:   + openmetadata_zone_id = (known after apply)%0A07:08:58.992 WARN   [aws] Config ./dns/terragrunt.hcl is a dependency of ./aws/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.%0A07:08:58.997 INFO   [aws] Downloading Terraform configurations from ../../../.. into ./aws/.terragrunt-cache/pbiOkBBHrrHJb5njeeHxxXzKnRg/vxdbUoFBPPcfo8ey7QUdnvPtOeY%0A07:08:59.696 INFO   [aws] terraform: Initializing the backend...%0A07:09:05.515 INFO   [aws] terraform: %0A07:09:05.515 INFO   [aws] terraform: Successfully configured the backend "s3"! Terraform will automatically%0A07:09:05.515 INFO   [aws] terraform: use this backend unless the backend configuration changes.%0A07:09:05.871 INFO   [aws] terraform: Initializing modules...%0A07:09:05.873 INFO   [aws] terraform: - iam_github_oidc in ../../../modules/cicd/iam_github_oidc%0A07:09:05.877 INFO   [aws] terraform: - network in ../../../modules/aws/network%0A07:09:05.878 INFO   [aws] terraform: - openmetadata_aurora in ../../../modules/aws/openmetadata/aurora%0A07:09:05.878 INFO   [aws] terraform: - openmetadata_cloudwatch in ../../../modules/aws/openmetadata/cloudwatch%0A07:09:05.879 INFO   [aws] terraform: - openmetadata_ecr in ../../../modules/aws/openmetadata/ecr%0A07:09:05.881 INFO   [aws] terraform: - openmetadata_ecs in ../../../modules/aws/openmetadata/ecs%0A07:09:05.882 INFO   [aws] terraform: - openmetadata_iam in ../../../modules/aws/openmetadata/iam%0A07:09:05.883 INFO   [aws] terraform: - openmetadata_kms_key in ../../../modules/aws/openmetadata/kms_key%0A07:09:05.883 INFO   [aws] terraform: - openmetadata_lb in ../../../modules/aws/openmetadata/load_balancer%0A07:09:05.884 INFO   [aws] terraform: - openmetadata_s3 in ../../../modules/aws/openmetadata/s3%0A07:09:05.885 INFO   [aws] terraform: - openmetadata_secretmanager in ../../../modules/aws/openmetadata/secrets_manager%0A07:09:05.886 INFO   [aws] terraform: - openmetadata_security_group in ../../../modules/aws/openmetadata/security_group%0A07:09:05.888 INFO   [aws] terraform: Initializing provider plugins...%0A07:09:05.888 INFO   [aws] terraform: - terraform.io/builtin/terraform is built in to Terraform%0A07:09:05.889 INFO   [aws] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...%0A07:09:05.952 INFO   [aws] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...%0A07:09:05.973 INFO   [aws] terraform: - Finding latest version of hashicorp/tls...%0A07:09:06.009 INFO   [aws] terraform: - Finding latest version of hashicorp/archive...%0A07:09:06.066 INFO   [aws] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...%0A07:09:06.118 INFO   [aws] terraform: - Installing hashicorp/random v3.7.2...%0A07:09:06.300 INFO   [aws] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)%0A07:09:06.332 INFO   [aws] terraform: - Installing hashicorp/aws v6.0.0...%0A07:09:11.677 INFO   [aws] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)%0A07:09:11.752 INFO   [aws] terraform: - Installing hashicorp/tls v4.1.0...%0A07:09:11.933 INFO   [aws] terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)%0A07:09:12.002 INFO   [aws] terraform: - Installing hashicorp/archive v2.7.1...%0A07:09:12.164 INFO   [aws] terraform: - Installed hashicorp/archive v2.7.1 (signed by HashiCorp)%0A07:09:12.197 INFO   [aws] terraform: - Installing hashicorp/http v3.5.0...%0A07:09:12.369 INFO   [aws] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)%0A07:09:12.369 INFO   [aws] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider%0A07:09:12.369 INFO   [aws] terraform: selections it made above. Include this file in your version control repository%0A07:09:12.369 INFO   [aws] terraform: so that Terraform can guarantee to make the same selections by default when%0A07:09:12.369 INFO   [aws] terraform: you run "terraform init" in the future.%0A07:09:12.369 INFO   [aws] terraform: Terraform has been successfully initialized!%0A07:09:12.373 INFO   [aws] Executing hook: fmt%0A07:09:12.400 INFO   [aws] Executing hook: validate%0ASuccess! The configuration is valid.%0A%0A07:09:18.965 STDOUT [aws] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Reading...%0A07:09:18.972 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.openmetadata: Reading...%0A07:09:18.972 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.elasticsearch: Reading...%0A07:09:18.983 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.ingestion: Reading...%0A07:09:18.987 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.elasticsearch: Read complete after 0s [id=2e6ece34fd5add205532639c5bddb27a5957ff9b]%0A07:09:19.033 STDOUT [aws] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0A07:09:19.039 STDOUT [aws] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Reading...%0A07:09:19.046 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.ingestion: Read complete after 0s [id=c4d5a5d99d6c41ee12079a946d4464deb0c503cb]%0A07:09:19.048 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.openmetadata: Read complete after 0s [id=0519944ed018fc6af98d13a8d3358ec655e745b3]%0A07:09:19.073 STDOUT [aws] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]%0A07:09:19.861 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_caller_identity.current: Reading...%0A07:09:19.861 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_region.current: Reading...%0A07:09:19.861 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_region.current: Reading...%0A07:09:19.861 STDOUT [aws] terraform: module.openmetadata_ecs.data.aws_caller_identity.current: Reading...%0A07:09:19.866 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]%0A07:09:19.866 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]%0A07:09:19.878 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_caller_identity.current: Reading...%0A07:09:20.031 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_caller_identity.current: Read complete after 0s [id=921407950230]%0A07:09:20.199 STDOUT [aws] terraform: module.openmetadata_ecs.data.aws_caller_identity.current: Read complete after 0s [id=921407950230]%0A07:09:20.367 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_caller_identity.current: Read complete after 0s [id=921407950230]%0A07:09:20.576 STDOUT [aws] terraform: Terraform used the selected providers to generate the following execution%0A07:09:20.576 STDOUT [aws] terraform: plan. Resource actions are indicated with the following symbols:%0A07:09:20.576 STDOUT [aws] terraform:   + create%0A07:09:20.576 STDOUT [aws] terraform: Terraform will perform the following actions:%0A07:09:20.576 STDOUT [aws] terraform:   # module.iam_github_oidc.aws_iam_openid_connect_provider.this will be created%0A07:09:20.576 STDOUT [aws] terraform:   + resource "aws_iam_openid_connect_provider" "this" {%0A07:09:20.576 STDOUT [aws] terraform:       + arn             = (known after apply)%0A07:09:20.577 STDOUT [aws] terraform:       + client_id_list  = [%0A07:09:20.577 STDOUT [aws] terraform:           + "sts.amazonaws.com",%0A07:09:20.577 STDOUT [aws] terraform:         ]%0A07:09:20.577 STDOUT [aws] terraform:       + id              = (known after apply)%0A07:09:20.577 STDOUT [aws] terraform:       + tags_all        = (known after apply)%0A07:09:20.577 STDOUT [aws] terraform:       + thumbprint_list = [%0A07:09:20.577 STDOUT [aws] terraform:           + "2b18947a6a9fc7764fd8b5fb18a863b0c6dac24f",%0A07:09:20.577 STDOUT [aws] terraform:           + "dd55b4520291e276588f0dd02fafd83a7368e0fa",%0A07:09:20.577 STDOUT [aws] terraform:           + "7560d6f40fa55195f740ee2b1b7c0b4836cbe103",%0A07:09:20.577 STDOUT [aws] terraform:         ]%0A07:09:20.577 STDOUT [aws] terraform:       + url             = "https://token.actions.githubusercontent.com"%0A07:09:20.577 STDOUT [aws] terraform:     }%0A07:09:20.577 STDOUT [aws] terraform:   # module.iam_github_oidc.aws_iam_role.this will be created%0A07:09:20.577 STDOUT [aws] terraform:   + resource "aws_iam_role" "this" {%0A07:09:20.577 STDOUT [aws] terraform:       + arn                   = (known after apply)%0A07:09:20.577 STDOUT [aws] terraform:       + assume_role_policy    = (known after apply)%0A07:09:20.577 STDOUT [aws] terraform:       + create_date           = (known after apply)%0A07:09:20.577 STDOUT [aws] terraform:       + force_detach_policies = false%0A07:09:20.578 STDOUT [aws] terraform:       + id                    = (known after apply)%0A07:09:20.578 STDOUT [aws] terraform:       + managed_policy_arns   = (known after apply)%0A07:09:20.578 STDOUT [aws] terraform:       + max_session_duration  = 3600%0A07:09:20.578 STDOUT [aws] terraform:       + name                  = "ethan-dev-iamrole-apne1-oidc"%0A07:09:20.578 STDOUT [aws] terraform:       + name_prefix           = (known after apply)%0A07:09:20.578 STDOUT [aws] terraform:       + path                  = "/"%0A07:09:20.578 STDOUT [aws] terraform:       + tags_all              = (known after apply)%0A07:09:20.578 STDOUT [aws] terraform:       + unique_id             = (known after apply)%0A07:09:20.578 STDOUT [aws] terraform:       + inline_policy (known after apply)%0A07:09:20.578 STDOUT [aws] terraform:     }%0A07:09:20.578 STDOUT [aws] terraform:   # module.iam_github_oidc.aws_iam_role_policy_attachment.this will be created%0A07:09:20.578 STDOUT [aws] terraform:   + resource "aws_iam_role_policy_attachment" "this" {%0A07:09:20.578 STDOUT [aws] terraform:       + id         = (known after apply)%0A07:09:20.578 STDOUT [aws] terraform:       + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A07:09:20.578 STDOUT [aws] terraform:       + role       = "ethan-dev-iamrole-apne1-oidc"%0A07:09:20.578 STDOUT [aws] terraform:     }%0A07:09:20.578 STDOUT [aws] terraform:   # module.network.aws_default_network_acl.default will be created%0A07:09:20.578 STDOUT [aws] terraform:   + resource "aws_default_network_acl" "default" {%0A07:09:20.579 STDOUT [aws] terraform:       + arn                    = (known after apply)%0A07:09:20.579 STDOUT [aws] terraform:       + default_network_acl_id = (known after apply)%0A07:09:20.579 STDOUT [aws] terraform:       + id                     = (known after apply)%0A07:09:20.579 STDOUT [aws] terraform:       + owner_id               = (known after apply)%0A07:09:20.579 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"%0A07:09:20.579 STDOUT [aws] terraform:       + subnet_ids             = (known after apply)%0A07:09:20.579 STDOUT [aws] terraform:       + tags                   = {%0A07:09:20.579 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nacl-default"%0A07:09:20.579 STDOUT [aws] terraform:         }%0A07:09:20.579 STDOUT [aws] terraform:       + tags_all               = {%0A07:09:20.579 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nacl-default"%0A07:09:20.579 STDOUT [aws] terraform:         }%0A07:09:20.579 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)%0A07:09:20.579 STDOUT [aws] terraform:       + egress {%0A07:09:20.579 STDOUT [aws] terraform:           + action          = "allow"%0A07:09:20.580 STDOUT [aws] terraform:           + cidr_block      = "0.0.0.0/0"%0A07:09:20.580 STDOUT [aws] terraform:           + from_port       = 0%0A07:09:20.580 STDOUT [aws] terraform:           + icmp_code       = 0%0A07:09:20.580 STDOUT [aws] terraform:           + icmp_type       = 0%0A07:09:20.580 STDOUT [aws] terraform:           + protocol        = "-1"%0A07:09:20.580 STDOUT [aws] terraform:           + rule_no         = 100%0A07:09:20.580 STDOUT [aws] terraform:           + to_port         = 0%0A07:09:20.580 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)%0A07:09:20.580 STDOUT [aws] terraform:         }%0A07:09:20.580 STDOUT [aws] terraform:       + ingress {%0A07:09:20.580 STDOUT [aws] terraform:           + action          = "allow"%0A07:09:20.580 STDOUT [aws] terraform:           + cidr_block      = "0.0.0.0/0"%0A07:09:20.580 STDOUT [aws] terraform:           + from_port       = 0%0A07:09:20.580 STDOUT [aws] terraform:           + icmp_code       = 0%0A07:09:20.581 STDOUT [aws] terraform:           + icmp_type       = 0%0A07:09:20.581 STDOUT [aws] terraform:           + protocol        = "-1"%0A07:09:20.581 STDOUT [aws] terraform:           + rule_no         = 100%0A07:09:20.581 STDOUT [aws] terraform:           + to_port         = 0%0A07:09:20.581 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)%0A07:09:20.581 STDOUT [aws] terraform:         }%0A07:09:20.581 STDOUT [aws] terraform:     }%0A07:09:20.581 STDOUT [aws] terraform:   # module.network.aws_default_route_table.default will be created%0A07:09:20.581 STDOUT [aws] terraform:   + resource "aws_default_route_table" "default" {%0A07:09:20.582 STDOUT [aws] terraform:       + arn                    = (known after apply)%0A07:09:20.582 STDOUT [aws] terraform:       + default_route_table_id = (known after apply)%0A07:09:20.582 STDOUT [aws] terraform:       + id                     = (known after apply)%0A07:09:20.582 STDOUT [aws] terraform:       + owner_id               = (known after apply)%0A07:09:20.582 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"%0A07:09:20.582 STDOUT [aws] terraform:       + route                  = (known after apply)%0A07:09:20.582 STDOUT [aws] terraform:       + tags_all               = (known after apply)%0A07:09:20.582 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)%0A07:09:20.582 STDOUT [aws] terraform:     }%0A07:09:20.582 STDOUT [aws] terraform:   # module.network.aws_default_security_group.sg_default will be created%0A07:09:20.582 STDOUT [aws] terraform:   + resource "aws_default_security_group" "sg_default" {%0A07:09:20.583 STDOUT [aws] terraform:       + arn                    = (known after apply)%0A07:09:20.583 STDOUT [aws] terraform:       + description            = (known after apply)%0A07:09:20.583 STDOUT [aws] terraform:       + egress                 = (known after apply)%0A07:09:20.583 STDOUT [aws] terraform:       + id                     = (known after apply)%0A07:09:20.583 STDOUT [aws] terraform:       + ingress                = (known after apply)%0A07:09:20.583 STDOUT [aws] terraform:       + name                   = (known after apply)%0A07:09:20.584 STDOUT [aws] terraform:       + name_prefix            = (known after apply)%0A07:09:20.584 STDOUT [aws] terraform:       + owner_id               = (known after apply)%0A07:09:20.584 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"%0A07:09:20.584 STDOUT [aws] terraform:       + revoke_rules_on_delete = false%0A07:09:20.584 STDOUT [aws] terraform:       + tags                   = {%0A07:09:20.584 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-default"%0A07:09:20.584 STDOUT [aws] terraform:         }%0A07:09:20.584 STDOUT [aws] terraform:       + tags_all               = {%0A07:09:20.584 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-default"%0A07:09:20.585 STDOUT [aws] terraform:         }%0A07:09:20.585 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:     }%0A07:09:20.585 STDOUT [aws] terraform:   # module.network.aws_eip.nat_a will be created%0A07:09:20.585 STDOUT [aws] terraform:   + resource "aws_eip" "nat_a" {%0A07:09:20.585 STDOUT [aws] terraform:       + allocation_id        = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + arn                  = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + association_id       = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + carrier_ip           = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + customer_owned_ip    = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + domain               = "vpc"%0A07:09:20.585 STDOUT [aws] terraform:       + id                   = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + instance             = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + ipam_pool_id         = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + network_border_group = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + network_interface    = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + private_dns          = (known after apply)%0A07:09:20.585 STDOUT [aws] terraform:       + private_ip           = (known after apply)%0A07:09:20.586 STDOUT [aws] terraform:       + ptr_record           = (known after apply)%0A07:09:20.586 STDOUT [aws] terraform:       + public_dns           = (known after apply)%0A07:09:20.586 STDOUT [aws] terraform:       + public_ip            = (known after apply)%0A07:09:20.586 STDOUT [aws] terraform:       + public_ipv4_pool     = (known after apply)%0A07:09:20.586 STDOUT [aws] terraform:       + region               = "ap-northeast-1"%0A07:09:20.586 STDOUT [aws] terraform:       + tags                 = {%0A07:09:20.586 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-a"%0A07:09:20.586 STDOUT [aws] terraform:         }%0A07:09:20.586 STDOUT [aws] terraform:       + tags_all             = {%0A07:09:20.586 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-a"%0A07:09:20.586 STDOUT [aws] terraform:         }%0A07:09:20.586 STDOUT [aws] terraform:     }%0A07:09:20.586 STDOUT [aws] terraform:   # module.network.aws_eip.nat_c will be created%0A07:09:20.586 STDOUT [aws] terraform:   + resource "aws_eip" "nat_c" {%0A07:09:20.586 STDOUT [aws] terraform:       + allocation_id        = (known after apply)%0A07:09:20.586 STDOUT [aws] terraform:       + arn                  = (known after apply)%0A07:09:20.586 STDOUT [aws] terraform:       + association_id       = (known after apply)%0A07:09:20.587 STDOUT [aws] terraform:       + carrier_ip           = (known after apply)%0A07:09:20.587 STDOUT [aws] terraform:       + customer_owned_ip    = (known after apply)%0A07:09:20.587 STDOUT [aws] terraform:       + domain               = "vpc"%0A07:09:20.587 STDOUT [aws] terraform:       + id                   = (known after apply)%0A07:09:20.587 STDOUT [aws] terraform:       + instance             = (known after apply)%0A07:09:20.587 STDOUT [aws] terraform:       + ipam_pool_id         = (known after apply)%0A07:09:20.587 STDOUT [aws] terraform:       + network_border_group = (known after apply)%0A07:09:20.587 STDOUT [aws] terraform:       + network_interface    = (known after apply)%0A07:09:20.588 STDOUT [aws] terraform:       + private_dns          = (known after apply)%0A07:09:20.588 STDOUT [aws] terraform:       + private_ip           = (known after apply)%0A07:09:20.588 STDOUT [aws] terraform:       + ptr_record           = (known after apply)%0A07:09:20.588 STDOUT [aws] terraform:       + public_dns           = (known after apply)%0A07:09:20.588 STDOUT [aws] terraform:       + public_ip            = (known after apply)%0A07:09:20.588 STDOUT [aws] terraform:       + public_ipv4_pool     = (known after apply)%0A07:09:20.588 STDOUT [aws] terraform:       + region               = "ap-northeast-1"%0A07:09:20.588 STDOUT [aws] terraform:       + tags                 = {%0A07:09:20.588 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-c"%0A07:09:20.588 STDOUT [aws] terraform:         }%0A07:09:20.588 STDOUT [aws] terraform:       + tags_all             = {%0A07:09:20.588 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-c"%0A07:09:20.588 STDOUT [aws] terraform:         }%0A07:09:20.588 STDOUT [aws] terraform:     }%0A07:09:20.588 STDOUT [aws] terraform:   # module.network.aws_internet_gateway.this will be created%0A07:09:20.588 STDOUT [aws] terraform:   + resource "aws_internet_gateway" "this" {%0A07:09:20.588 STDOUT [aws] terraform:       + arn      = (known after apply)%0A07:09:20.588 STDOUT [aws] terraform:       + id       = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:       + owner_id = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:       + region   = "ap-northeast-1"%0A07:09:20.589 STDOUT [aws] terraform:       + tags     = {%0A07:09:20.589 STDOUT [aws] terraform:           + "Name" = "ethan-dev-igw-apne1"%0A07:09:20.589 STDOUT [aws] terraform:         }%0A07:09:20.589 STDOUT [aws] terraform:       + tags_all = {%0A07:09:20.589 STDOUT [aws] terraform:           + "Name" = "ethan-dev-igw-apne1"%0A07:09:20.589 STDOUT [aws] terraform:         }%0A07:09:20.589 STDOUT [aws] terraform:       + vpc_id   = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:     }%0A07:09:20.589 STDOUT [aws] terraform:   # module.network.aws_nat_gateway.public_a will be created%0A07:09:20.589 STDOUT [aws] terraform:   + resource "aws_nat_gateway" "public_a" {%0A07:09:20.589 STDOUT [aws] terraform:       + allocation_id                      = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:       + association_id                     = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:       + connectivity_type                  = "public"%0A07:09:20.589 STDOUT [aws] terraform:       + id                                 = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:       + network_interface_id               = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:       + private_ip                         = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:       + public_ip                          = (known after apply)%0A07:09:20.589 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"%0A07:09:20.590 STDOUT [aws] terraform:       + secondary_private_ip_address_count = (known after apply)%0A07:09:20.590 STDOUT [aws] terraform:       + secondary_private_ip_addresses     = (known after apply)%0A07:09:20.590 STDOUT [aws] terraform:       + subnet_id                          = (known after apply)%0A07:09:20.590 STDOUT [aws] terraform:       + tags                               = {%0A07:09:20.590 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-a"%0A07:09:20.590 STDOUT [aws] terraform:         }%0A07:09:20.590 STDOUT [aws] terraform:       + tags_all                           = {%0A07:09:20.590 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-a"%0A07:09:20.590 STDOUT [aws] terraform:         }%0A07:09:20.590 STDOUT [aws] terraform:     }%0A07:09:20.590 STDOUT [aws] terraform:   # module.network.aws_nat_gateway.public_c will be created%0A07:09:20.590 STDOUT [aws] terraform:   + resource "aws_nat_gateway" "public_c" {%0A07:09:20.590 STDOUT [aws] terraform:       + allocation_id                      = (known after apply)%0A07:09:20.590 STDOUT [aws] terraform:       + association_id                     = (known after apply)%0A07:09:20.590 STDOUT [aws] terraform:       + connectivity_type                  = "public"%0A07:09:20.590 STDOUT [aws] terraform:       + id                                 = (known after apply)%0A07:09:20.590 STDOUT [aws] terraform:       + network_interface_id               = (known after apply)%0A07:09:20.590 STDOUT [aws] terraform:       + private_ip                         = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + public_ip                          = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"%0A07:09:20.591 STDOUT [aws] terraform:       + secondary_private_ip_address_count = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + secondary_private_ip_addresses     = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + subnet_id                          = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + tags                               = {%0A07:09:20.591 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-c"%0A07:09:20.591 STDOUT [aws] terraform:         }%0A07:09:20.591 STDOUT [aws] terraform:       + tags_all                           = {%0A07:09:20.591 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-c"%0A07:09:20.591 STDOUT [aws] terraform:         }%0A07:09:20.591 STDOUT [aws] terraform:     }%0A07:09:20.591 STDOUT [aws] terraform:   # module.network.aws_route_table.private_a will be created%0A07:09:20.591 STDOUT [aws] terraform:   + resource "aws_route_table" "private_a" {%0A07:09:20.591 STDOUT [aws] terraform:       + arn              = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + owner_id         = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)%0A07:09:20.591 STDOUT [aws] terraform:       + region           = "ap-northeast-1"%0A07:09:20.591 STDOUT [aws] terraform:       + route            = [%0A07:09:20.592 STDOUT [aws] terraform:           + {%0A07:09:20.592 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"%0A07:09:20.592 STDOUT [aws] terraform:               + nat_gateway_id             = (known after apply)%0A07:09:20.592 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)%0A07:09:20.592 STDOUT [aws] terraform:             },%0A07:09:20.592 STDOUT [aws] terraform:         ]%0A07:09:20.592 STDOUT [aws] terraform:       + tags             = {%0A07:09:20.592 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-a"%0A07:09:20.592 STDOUT [aws] terraform:         }%0A07:09:20.592 STDOUT [aws] terraform:       + tags_all         = {%0A07:09:20.592 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-a"%0A07:09:20.592 STDOUT [aws] terraform:         }%0A07:09:20.592 STDOUT [aws] terraform:       + vpc_id           = (known after apply)%0A07:09:20.592 STDOUT [aws] terraform:     }%0A07:09:20.592 STDOUT [aws] terraform:   # module.network.aws_route_table.private_c will be created%0A07:09:20.592 STDOUT [aws] terraform:   + resource "aws_route_table" "private_c" {%0A07:09:20.592 STDOUT [aws] terraform:       + arn              = (known after apply)%0A07:09:20.592 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.592 STDOUT [aws] terraform:       + owner_id         = (known after apply)%0A07:09:20.592 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)%0A07:09:20.592 STDOUT [aws] terraform:       + region           = "ap-northeast-1"%0A07:09:20.592 STDOUT [aws] terraform:       + route            = [%0A07:09:20.592 STDOUT [aws] terraform:           + {%0A07:09:20.592 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"%0A07:09:20.593 STDOUT [aws] terraform:               + nat_gateway_id             = (known after apply)%0A07:09:20.593 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)%0A07:09:20.593 STDOUT [aws] terraform:             },%0A07:09:20.593 STDOUT [aws] terraform:         ]%0A07:09:20.593 STDOUT [aws] terraform:       + tags             = {%0A07:09:20.593 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-c"%0A07:09:20.593 STDOUT [aws] terraform:         }%0A07:09:20.593 STDOUT [aws] terraform:       + tags_all         = {%0A07:09:20.593 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-c"%0A07:09:20.593 STDOUT [aws] terraform:         }%0A07:09:20.593 STDOUT [aws] terraform:       + vpc_id           = (known after apply)%0A07:09:20.593 STDOUT [aws] terraform:     }%0A07:09:20.593 STDOUT [aws] terraform:   # module.network.aws_route_table.public will be created%0A07:09:20.593 STDOUT [aws] terraform:   + resource "aws_route_table" "public" {%0A07:09:20.593 STDOUT [aws] terraform:       + arn              = (known after apply)%0A07:09:20.593 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.593 STDOUT [aws] terraform:       + owner_id         = (known after apply)%0A07:09:20.593 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)%0A07:09:20.593 STDOUT [aws] terraform:       + region           = "ap-northeast-1"%0A07:09:20.593 STDOUT [aws] terraform:       + route            = [%0A07:09:20.593 STDOUT [aws] terraform:           + {%0A07:09:20.593 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"%0A07:09:20.594 STDOUT [aws] terraform:               + gateway_id                 = (known after apply)%0A07:09:20.594 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)%0A07:09:20.594 STDOUT [aws] terraform:             },%0A07:09:20.594 STDOUT [aws] terraform:         ]%0A07:09:20.594 STDOUT [aws] terraform:       + tags             = {%0A07:09:20.594 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-public"%0A07:09:20.594 STDOUT [aws] terraform:         }%0A07:09:20.594 STDOUT [aws] terraform:       + tags_all         = {%0A07:09:20.594 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-public"%0A07:09:20.594 STDOUT [aws] terraform:         }%0A07:09:20.594 STDOUT [aws] terraform:       + vpc_id           = (known after apply)%0A07:09:20.594 STDOUT [aws] terraform:     }%0A07:09:20.594 STDOUT [aws] terraform:   # module.network.aws_route_table_association.private_a will be created%0A07:09:20.594 STDOUT [aws] terraform:   + resource "aws_route_table_association" "private_a" {%0A07:09:20.594 STDOUT [aws] terraform:       + id             = (known after apply)%0A07:09:20.594 STDOUT [aws] terraform:       + region         = "ap-northeast-1"%0A07:09:20.594 STDOUT [aws] terraform:       + route_table_id = (known after apply)%0A07:09:20.594 STDOUT [aws] terraform:       + subnet_id      = (known after apply)%0A07:09:20.594 STDOUT [aws] terraform:     }%0A07:09:20.594 STDOUT [aws] terraform:   # module.network.aws_route_table_association.private_c will be created%0A07:09:20.594 STDOUT [aws] terraform:   + resource "aws_route_table_association" "private_c" {%0A07:09:20.594 STDOUT [aws] terraform:       + id             = (known after apply)%0A07:09:20.594 STDOUT [aws] terraform:       + region         = "ap-northeast-1"%0A07:09:20.595 STDOUT [aws] terraform:       + route_table_id = (known after apply)%0A07:09:20.595 STDOUT [aws] terraform:       + subnet_id      = (known after apply)%0A07:09:20.595 STDOUT [aws] terraform:     }%0A07:09:20.595 STDOUT [aws] terraform:   # module.network.aws_route_table_association.public_a will be created%0A07:09:20.595 STDOUT [aws] terraform:   + resource "aws_route_table_association" "public_a" {%0A07:09:20.595 STDOUT [aws] terraform:       + id             = (known after apply)%0A07:09:20.595 STDOUT [aws] terraform:       + region         = "ap-northeast-1"%0A07:09:20.595 STDOUT [aws] terraform:       + route_table_id = (known after apply)%0A07:09:20.595 STDOUT [aws] terraform:       + subnet_id      = (known after apply)%0A07:09:20.595 STDOUT [aws] terraform:     }%0A07:09:20.595 STDOUT [aws] terraform:   # module.network.aws_route_table_association.public_c will be created%0A07:09:20.595 STDOUT [aws] terraform:   + resource "aws_route_table_association" "public_c" {%0A07:09:20.595 STDOUT [aws] terraform:       + id             = (known after apply)%0A07:09:20.595 STDOUT [aws] terraform:       + region         = "ap-northeast-1"%0A07:09:20.595 STDOUT [aws] terraform:       + route_table_id = (known after apply)%0A07:09:20.595 STDOUT [aws] terraform:       + subnet_id      = (known after apply)%0A07:09:20.595 STDOUT [aws] terraform:     }%0A07:09:20.595 STDOUT [aws] terraform:   # module.network.aws_security_group.self_reference will be created%0A07:09:20.595 STDOUT [aws] terraform:   + resource "aws_security_group" "self_reference" {%0A07:09:20.595 STDOUT [aws] terraform:       + arn                    = (known after apply)%0A07:09:20.596 STDOUT [aws] terraform:       + description            = "self-reference"%0A07:09:20.596 STDOUT [aws] terraform:       + egress                 = [%0A07:09:20.596 STDOUT [aws] terraform:           + {%0A07:09:20.596 STDOUT [aws] terraform:               + cidr_blocks      = [%0A07:09:20.596 STDOUT [aws] terraform:                   + "0.0.0.0/0",%0A07:09:20.596 STDOUT [aws] terraform:                 ]%0A07:09:20.596 STDOUT [aws] terraform:               + from_port        = 0%0A07:09:20.596 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []%0A07:09:20.596 STDOUT [aws] terraform:               + prefix_list_ids  = []%0A07:09:20.596 STDOUT [aws] terraform:               + protocol         = "-1"%0A07:09:20.596 STDOUT [aws] terraform:               + security_groups  = []%0A07:09:20.596 STDOUT [aws] terraform:               + self             = false%0A07:09:20.596 STDOUT [aws] terraform:               + to_port          = 0%0A07:09:20.596 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)%0A07:09:20.596 STDOUT [aws] terraform:             },%0A07:09:20.596 STDOUT [aws] terraform:         ]%0A07:09:20.596 STDOUT [aws] terraform:       + id                     = (known after apply)%0A07:09:20.596 STDOUT [aws] terraform:       + ingress                = [%0A07:09:20.596 STDOUT [aws] terraform:           + {%0A07:09:20.596 STDOUT [aws] terraform:               + cidr_blocks      = []%0A07:09:20.596 STDOUT [aws] terraform:               + from_port        = 0%0A07:09:20.596 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []%0A07:09:20.596 STDOUT [aws] terraform:               + prefix_list_ids  = []%0A07:09:20.597 STDOUT [aws] terraform:               + protocol         = "-1"%0A07:09:20.597 STDOUT [aws] terraform:               + security_groups  = []%0A07:09:20.597 STDOUT [aws] terraform:               + self             = true%0A07:09:20.597 STDOUT [aws] terraform:               + to_port          = 0%0A07:09:20.597 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)%0A07:09:20.597 STDOUT [aws] terraform:             },%0A07:09:20.597 STDOUT [aws] terraform:         ]%0A07:09:20.597 STDOUT [aws] terraform:       + name                   = "ethan-dev-sg-self-reference"%0A07:09:20.597 STDOUT [aws] terraform:       + name_prefix            = (known after apply)%0A07:09:20.597 STDOUT [aws] terraform:       + owner_id               = (known after apply)%0A07:09:20.597 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"%0A07:09:20.597 STDOUT [aws] terraform:       + revoke_rules_on_delete = false%0A07:09:20.597 STDOUT [aws] terraform:       + tags                   = {%0A07:09:20.597 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-self-reference"%0A07:09:20.597 STDOUT [aws] terraform:         }%0A07:09:20.597 STDOUT [aws] terraform:       + tags_all               = {%0A07:09:20.597 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-self-reference"%0A07:09:20.597 STDOUT [aws] terraform:         }%0A07:09:20.597 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)%0A07:09:20.597 STDOUT [aws] terraform:     }%0A07:09:20.597 STDOUT [aws] terraform:   # module.network.aws_subnet.private_a will be created%0A07:09:20.597 STDOUT [aws] terraform:   + resource "aws_subnet" "private_a" {%0A07:09:20.598 STDOUT [aws] terraform:       + arn                                            = (known after apply)%0A07:09:20.598 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false%0A07:09:20.598 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1a"%0A07:09:20.598 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)%0A07:09:20.598 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.10.0/24"%0A07:09:20.598 STDOUT [aws] terraform:       + enable_dns64                                   = false%0A07:09:20.598 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false%0A07:09:20.598 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false%0A07:09:20.598 STDOUT [aws] terraform:       + id                                             = (known after apply)%0A07:09:20.598 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)%0A07:09:20.598 STDOUT [aws] terraform:       + ipv6_native                                    = false%0A07:09:20.598 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false%0A07:09:20.598 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)%0A07:09:20.598 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)%0A07:09:20.598 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"%0A07:09:20.599 STDOUT [aws] terraform:       + tags                                           = {%0A07:09:20.599 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-a"%0A07:09:20.599 STDOUT [aws] terraform:         }%0A07:09:20.599 STDOUT [aws] terraform:       + tags_all                                       = {%0A07:09:20.599 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-a"%0A07:09:20.599 STDOUT [aws] terraform:         }%0A07:09:20.599 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)%0A07:09:20.599 STDOUT [aws] terraform:     }%0A07:09:20.599 STDOUT [aws] terraform:   # module.network.aws_subnet.private_c will be created%0A07:09:20.599 STDOUT [aws] terraform:   + resource "aws_subnet" "private_c" {%0A07:09:20.599 STDOUT [aws] terraform:       + arn                                            = (known after apply)%0A07:09:20.599 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false%0A07:09:20.599 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1c"%0A07:09:20.599 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)%0A07:09:20.599 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.11.0/24"%0A07:09:20.599 STDOUT [aws] terraform:       + enable_dns64                                   = false%0A07:09:20.599 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false%0A07:09:20.600 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false%0A07:09:20.600 STDOUT [aws] terraform:       + id                                             = (known after apply)%0A07:09:20.600 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)%0A07:09:20.600 STDOUT [aws] terraform:       + ipv6_native                                    = false%0A07:09:20.600 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false%0A07:09:20.600 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)%0A07:09:20.600 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)%0A07:09:20.600 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"%0A07:09:20.600 STDOUT [aws] terraform:       + tags                                           = {%0A07:09:20.600 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-c"%0A07:09:20.600 STDOUT [aws] terraform:         }%0A07:09:20.600 STDOUT [aws] terraform:       + tags_all                                       = {%0A07:09:20.600 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-c"%0A07:09:20.600 STDOUT [aws] terraform:         }%0A07:09:20.600 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)%0A07:09:20.600 STDOUT [aws] terraform:     }%0A07:09:20.600 STDOUT [aws] terraform:   # module.network.aws_subnet.public_a will be created%0A07:09:20.600 STDOUT [aws] terraform:   + resource "aws_subnet" "public_a" {%0A07:09:20.601 STDOUT [aws] terraform:       + arn                                            = (known after apply)%0A07:09:20.601 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false%0A07:09:20.601 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1a"%0A07:09:20.601 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)%0A07:09:20.601 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.0.0/24"%0A07:09:20.601 STDOUT [aws] terraform:       + enable_dns64                                   = false%0A07:09:20.601 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false%0A07:09:20.601 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false%0A07:09:20.601 STDOUT [aws] terraform:       + id                                             = (known after apply)%0A07:09:20.601 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)%0A07:09:20.601 STDOUT [aws] terraform:       + ipv6_native                                    = false%0A07:09:20.601 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false%0A07:09:20.601 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)%0A07:09:20.601 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)%0A07:09:20.602 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"%0A07:09:20.602 STDOUT [aws] terraform:       + tags                                           = {%0A07:09:20.602 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-a"%0A07:09:20.602 STDOUT [aws] terraform:         }%0A07:09:20.602 STDOUT [aws] terraform:       + tags_all                                       = {%0A07:09:20.602 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-a"%0A07:09:20.602 STDOUT [aws] terraform:         }%0A07:09:20.602 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)%0A07:09:20.602 STDOUT [aws] terraform:     }%0A07:09:20.602 STDOUT [aws] terraform:   # module.network.aws_subnet.public_c will be created%0A07:09:20.602 STDOUT [aws] terraform:   + resource "aws_subnet" "public_c" {%0A07:09:20.602 STDOUT [aws] terraform:       + arn                                            = (known after apply)%0A07:09:20.602 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false%0A07:09:20.602 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1c"%0A07:09:20.602 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)%0A07:09:20.602 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.1.0/24"%0A07:09:20.602 STDOUT [aws] terraform:       + enable_dns64                                   = false%0A07:09:20.602 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false%0A07:09:20.603 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false%0A07:09:20.603 STDOUT [aws] terraform:       + id                                             = (known after apply)%0A07:09:20.603 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)%0A07:09:20.603 STDOUT [aws] terraform:       + ipv6_native                                    = false%0A07:09:20.603 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false%0A07:09:20.603 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)%0A07:09:20.603 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)%0A07:09:20.603 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"%0A07:09:20.603 STDOUT [aws] terraform:       + tags                                           = {%0A07:09:20.603 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-c"%0A07:09:20.603 STDOUT [aws] terraform:         }%0A07:09:20.603 STDOUT [aws] terraform:       + tags_all                                       = {%0A07:09:20.603 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-c"%0A07:09:20.603 STDOUT [aws] terraform:         }%0A07:09:20.603 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)%0A07:09:20.603 STDOUT [aws] terraform:     }%0A07:09:20.603 STDOUT [aws] terraform:   # module.network.aws_vpc.this will be created%0A07:09:20.604 STDOUT [aws] terraform:   + resource "aws_vpc" "this" {%0A07:09:20.604 STDOUT [aws] terraform:       + arn                                  = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + cidr_block                           = "10.0.0.0/16"%0A07:09:20.604 STDOUT [aws] terraform:       + default_network_acl_id               = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + default_route_table_id               = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + default_security_group_id            = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + dhcp_options_id                      = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + enable_dns_hostnames                 = true%0A07:09:20.604 STDOUT [aws] terraform:       + enable_dns_support                   = true%0A07:09:20.604 STDOUT [aws] terraform:       + enable_network_address_usage_metrics = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + id                                   = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + instance_tenancy                     = "default"%0A07:09:20.604 STDOUT [aws] terraform:       + ipv6_association_id                  = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + ipv6_cidr_block                      = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + ipv6_cidr_block_network_border_group = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + main_route_table_id                  = (known after apply)%0A07:09:20.604 STDOUT [aws] terraform:       + owner_id                             = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + region                               = "ap-northeast-1"%0A07:09:20.605 STDOUT [aws] terraform:       + tags                                 = {%0A07:09:20.605 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpc-apne1"%0A07:09:20.605 STDOUT [aws] terraform:         }%0A07:09:20.605 STDOUT [aws] terraform:       + tags_all                             = {%0A07:09:20.605 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpc-apne1"%0A07:09:20.605 STDOUT [aws] terraform:         }%0A07:09:20.605 STDOUT [aws] terraform:     }%0A07:09:20.605 STDOUT [aws] terraform:   # module.network.aws_vpc_endpoint.s3 will be created%0A07:09:20.605 STDOUT [aws] terraform:   + resource "aws_vpc_endpoint" "s3" {%0A07:09:20.605 STDOUT [aws] terraform:       + arn                   = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + cidr_blocks           = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + dns_entry             = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + id                    = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + ip_address_type       = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + network_interface_ids = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + owner_id              = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + policy                = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + prefix_list_id        = (known after apply)%0A07:09:20.605 STDOUT [aws] terraform:       + private_dns_enabled   = (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + region                = "ap-northeast-1"%0A07:09:20.606 STDOUT [aws] terraform:       + requester_managed     = (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + route_table_ids       = (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + security_group_ids    = (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + service_name          = "com.amazonaws.ap-northeast-1.s3"%0A07:09:20.606 STDOUT [aws] terraform:       + service_region        = (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + state                 = (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + subnet_ids            = (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + tags                  = {%0A07:09:20.606 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpce-apne1-s3"%0A07:09:20.606 STDOUT [aws] terraform:         }%0A07:09:20.606 STDOUT [aws] terraform:       + tags_all              = {%0A07:09:20.606 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpce-apne1-s3"%0A07:09:20.606 STDOUT [aws] terraform:         }%0A07:09:20.606 STDOUT [aws] terraform:       + vpc_endpoint_type     = "Gateway"%0A07:09:20.606 STDOUT [aws] terraform:       + vpc_id                = (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + dns_options (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:       + subnet_configuration (known after apply)%0A07:09:20.606 STDOUT [aws] terraform:     }%0A07:09:20.607 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_db_subnet_group.aurora_group will be created%0A07:09:20.607 STDOUT [aws] terraform:   + resource "aws_db_subnet_group" "aurora_group" {%0A07:09:20.607 STDOUT [aws] terraform:       + arn                     = (known after apply)%0A07:09:20.607 STDOUT [aws] terraform:       + description             = "Managed by Terraform"%0A07:09:20.607 STDOUT [aws] terraform:       + id                      = (known after apply)%0A07:09:20.607 STDOUT [aws] terraform:       + name                    = "ethan-dev-aurora-apne1-subnet-group"%0A07:09:20.607 STDOUT [aws] terraform:       + name_prefix             = (known after apply)%0A07:09:20.607 STDOUT [aws] terraform:       + region                  = "ap-northeast-1"%0A07:09:20.607 STDOUT [aws] terraform:       + subnet_ids              = (known after apply)%0A07:09:20.607 STDOUT [aws] terraform:       + supported_network_types = (known after apply)%0A07:09:20.607 STDOUT [aws] terraform:       + tags_all                = (known after apply)%0A07:09:20.607 STDOUT [aws] terraform:       + vpc_id                  = (known after apply)%0A07:09:20.607 STDOUT [aws] terraform:     }%0A07:09:20.607 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster.aurora will be created%0A07:09:20.607 STDOUT [aws] terraform:   + resource "aws_rds_cluster" "aurora" {%0A07:09:20.607 STDOUT [aws] terraform:       + allocated_storage                     = (known after apply)%0A07:09:20.607 STDOUT [aws] terraform:       + apply_immediately                     = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + arn                                   = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + availability_zones                    = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + backup_retention_period               = 1%0A07:09:20.608 STDOUT [aws] terraform:       + ca_certificate_identifier             = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + ca_certificate_valid_till             = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + cluster_identifier                    = "ethan-dev-aurora-apne1-cluster"%0A07:09:20.608 STDOUT [aws] terraform:       + cluster_identifier_prefix             = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + cluster_members                       = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + cluster_resource_id                   = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + cluster_scalability_type              = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + copy_tags_to_snapshot                 = false%0A07:09:20.608 STDOUT [aws] terraform:       + database_insights_mode                = (known after apply)%0A07:09:20.608 STDOUT [aws] terraform:       + database_name                         = "openmetadata"%0A07:09:20.608 STDOUT [aws] terraform:       + db_cluster_parameter_group_name       = "ethan-dev-aurora-apne1-param-group"%0A07:09:20.608 STDOUT [aws] terraform:       + db_subnet_group_name                  = "ethan-dev-aurora-apne1-subnet-group"%0A07:09:20.609 STDOUT [aws] terraform:       + db_system_id                          = (known after apply)%0A07:09:20.609 STDOUT [aws] terraform:       + delete_automated_backups              = true%0A07:09:20.609 STDOUT [aws] terraform:       + deletion_protection                   = true%0A07:09:20.609 STDOUT [aws] terraform:       + enable_global_write_forwarding        = false%0A07:09:20.609 STDOUT [aws] terraform:       + enable_http_endpoint                  = true%0A07:09:20.609 STDOUT [aws] terraform:       + enable_local_write_forwarding         = false%0A07:09:20.609 STDOUT [aws] terraform:       + enabled_cloudwatch_logs_exports       = [%0A07:09:20.609 STDOUT [aws] terraform:           + "postgresql",%0A07:09:20.609 STDOUT [aws] terraform:         ]%0A07:09:20.609 STDOUT [aws] terraform:       + endpoint                              = (known after apply)%0A07:09:20.609 STDOUT [aws] terraform:       + engine                                = "aurora-postgresql"%0A07:09:20.609 STDOUT [aws] terraform:       + engine_lifecycle_support              = (known after apply)%0A07:09:20.609 STDOUT [aws] terraform:       + engine_mode                           = "provisioned"%0A07:09:20.609 STDOUT [aws] terraform:       + engine_version                        = "16.2"%0A07:09:20.610 STDOUT [aws] terraform:       + engine_version_actual                 = (known after apply)%0A07:09:20.610 STDOUT [aws] terraform:       + hosted_zone_id                        = (known after apply)%0A07:09:20.610 STDOUT [aws] terraform:       + iam_database_authentication_enabled   = true%0A07:09:20.610 STDOUT [aws] terraform:       + iam_roles                             = (known after apply)%0A07:09:20.610 STDOUT [aws] terraform:       + id                                    = (known after apply)%0A07:09:20.610 STDOUT [aws] terraform:       + kms_key_id                            = (known after apply)%0A07:09:20.610 STDOUT [aws] terraform:       + master_password                       = (sensitive value)%0A07:09:20.610 STDOUT [aws] terraform:       + master_password_wo                    = (write-only attribute)%0A07:09:20.610 STDOUT [aws] terraform:       + master_user_secret                    = (known after apply)%0A07:09:20.610 STDOUT [aws] terraform:       + master_user_secret_kms_key_id         = (known after apply)%0A07:09:20.610 STDOUT [aws] terraform:       + master_username                       = "openmetadata_admin"%0A07:09:20.610 STDOUT [aws] terraform:       + monitoring_interval                   = (known after apply)%0A07:09:20.610 STDOUT [aws] terraform:       + monitoring_role_arn                   = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + network_type                          = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + performance_insights_kms_key_id       = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + performance_insights_retention_period = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + port                                  = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + preferred_backup_window               = "08:00-08:30"%0A07:09:20.611 STDOUT [aws] terraform:       + preferred_maintenance_window          = "sun:09:00-sun:09:30"%0A07:09:20.611 STDOUT [aws] terraform:       + reader_endpoint                       = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + region                                = "ap-northeast-1"%0A07:09:20.611 STDOUT [aws] terraform:       + skip_final_snapshot                   = true%0A07:09:20.611 STDOUT [aws] terraform:       + storage_encrypted                     = true%0A07:09:20.611 STDOUT [aws] terraform:       + storage_type                          = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + tags_all                              = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + vpc_security_group_ids                = (known after apply)%0A07:09:20.611 STDOUT [aws] terraform:       + serverlessv2_scaling_configuration {%0A07:09:20.611 STDOUT [aws] terraform:           + max_capacity             = 1%0A07:09:20.612 STDOUT [aws] terraform:           + min_capacity             = 0%0A07:09:20.612 STDOUT [aws] terraform:           + seconds_until_auto_pause = (known after apply)%0A07:09:20.612 STDOUT [aws] terraform:         }%0A07:09:20.612 STDOUT [aws] terraform:     }%0A07:09:20.612 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster_instance.aurora_instance[0] will be created%0A07:09:20.612 STDOUT [aws] terraform:   + resource "aws_rds_cluster_instance" "aurora_instance" {%0A07:09:20.612 STDOUT [aws] terraform:       + apply_immediately                     = (known after apply)%0A07:09:20.612 STDOUT [aws] terraform:       + arn                                   = (known after apply)%0A07:09:20.612 STDOUT [aws] terraform:       + auto_minor_version_upgrade            = true%0A07:09:20.612 STDOUT [aws] terraform:       + availability_zone                     = (known after apply)%0A07:09:20.612 STDOUT [aws] terraform:       + ca_cert_identifier                    = (known after apply)%0A07:09:20.612 STDOUT [aws] terraform:       + cluster_identifier                    = (known after apply)%0A07:09:20.612 STDOUT [aws] terraform:       + copy_tags_to_snapshot                 = false%0A07:09:20.612 STDOUT [aws] terraform:       + db_parameter_group_name               = (known after apply)%0A07:09:20.612 STDOUT [aws] terraform:       + db_subnet_group_name                  = "ethan-dev-aurora-apne1-subnet-group"%0A07:09:20.612 STDOUT [aws] terraform:       + dbi_resource_id                       = (known after apply)%0A07:09:20.612 STDOUT [aws] terraform:       + endpoint                              = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + engine                                = "aurora-postgresql"%0A07:09:20.613 STDOUT [aws] terraform:       + engine_version                        = "16.2"%0A07:09:20.613 STDOUT [aws] terraform:       + engine_version_actual                 = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + force_destroy                         = false%0A07:09:20.613 STDOUT [aws] terraform:       + id                                    = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + identifier                            = "ethan-dev-aurora-apne1-instance-0"%0A07:09:20.613 STDOUT [aws] terraform:       + identifier_prefix                     = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + instance_class                        = "db.serverless"%0A07:09:20.613 STDOUT [aws] terraform:       + kms_key_id                            = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + monitoring_interval                   = 0%0A07:09:20.613 STDOUT [aws] terraform:       + monitoring_role_arn                   = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + network_type                          = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + performance_insights_enabled          = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + performance_insights_kms_key_id       = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + performance_insights_retention_period = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + port                                  = (known after apply)%0A07:09:20.613 STDOUT [aws] terraform:       + preferred_backup_window               = (known after apply)%0A07:09:20.614 STDOUT [aws] terraform:       + preferred_maintenance_window          = "sun:09:00-sun:09:30"%0A07:09:20.614 STDOUT [aws] terraform:       + promotion_tier                        = 0%0A07:09:20.614 STDOUT [aws] terraform:       + publicly_accessible                   = false%0A07:09:20.614 STDOUT [aws] terraform:       + region                                = "ap-northeast-1"%0A07:09:20.614 STDOUT [aws] terraform:       + storage_encrypted                     = (known after apply)%0A07:09:20.614 STDOUT [aws] terraform:       + tags_all                              = (known after apply)%0A07:09:20.614 STDOUT [aws] terraform:       + writer                                = (known after apply)%0A07:09:20.614 STDOUT [aws] terraform:     }%0A07:09:20.614 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster_parameter_group.aurora_param will be created%0A07:09:20.614 STDOUT [aws] terraform:   + resource "aws_rds_cluster_parameter_group" "aurora_param" {%0A07:09:20.614 STDOUT [aws] terraform:       + arn         = (known after apply)%0A07:09:20.614 STDOUT [aws] terraform:       + description = "Managed by Terraform"%0A07:09:20.614 STDOUT [aws] terraform:       + family      = "aurora-postgresql16"%0A07:09:20.614 STDOUT [aws] terraform:       + id          = (known after apply)%0A07:09:20.614 STDOUT [aws] terraform:       + name        = "ethan-dev-aurora-apne1-param-group"%0A07:09:20.614 STDOUT [aws] terraform:       + name_prefix = (known after apply)%0A07:09:20.614 STDOUT [aws] terraform:       + region      = "ap-northeast-1"%0A07:09:20.614 STDOUT [aws] terraform:       + tags_all    = (known after apply)%0A07:09:20.615 STDOUT [aws] terraform:       + parameter {%0A07:09:20.615 STDOUT [aws] terraform:           + apply_method = "immediate"%0A07:09:20.615 STDOUT [aws] terraform:           + name         = "timezone"%0A07:09:20.615 STDOUT [aws] terraform:           + value        = "Asia/Tokyo"%0A07:09:20.615 STDOUT [aws] terraform:         }%0A07:09:20.615 STDOUT [aws] terraform:     }%0A07:09:20.615 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.elastic_search will be created%0A07:09:20.615 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "elastic_search" {%0A07:09:20.615 STDOUT [aws] terraform:       + arn               = (known after apply)%0A07:09:20.615 STDOUT [aws] terraform:       + id                = (known after apply)%0A07:09:20.615 STDOUT [aws] terraform:       + log_group_class   = (known after apply)%0A07:09:20.615 STDOUT [aws] terraform:       + name              = "/aws/ecs/elastic-search"%0A07:09:20.615 STDOUT [aws] terraform:       + name_prefix       = (known after apply)%0A07:09:20.615 STDOUT [aws] terraform:       + region            = "ap-northeast-1"%0A07:09:20.615 STDOUT [aws] terraform:       + retention_in_days = 30%0A07:09:20.615 STDOUT [aws] terraform:       + skip_destroy      = false%0A07:09:20.615 STDOUT [aws] terraform:       + tags_all          = (known after apply)%0A07:09:20.615 STDOUT [aws] terraform:     }%0A07:09:20.615 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.migrate_all will be created%0A07:09:20.615 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "migrate_all" {%0A07:09:20.616 STDOUT [aws] terraform:       + arn               = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:       + id                = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:       + log_group_class   = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:       + name              = "/aws/ecs/migrate-all"%0A07:09:20.616 STDOUT [aws] terraform:       + name_prefix       = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:       + region            = "ap-northeast-1"%0A07:09:20.616 STDOUT [aws] terraform:       + retention_in_days = 30%0A07:09:20.616 STDOUT [aws] terraform:       + skip_destroy      = false%0A07:09:20.616 STDOUT [aws] terraform:       + tags_all          = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:     }%0A07:09:20.616 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.openmetadata_airflow will be created%0A07:09:20.616 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "openmetadata_airflow" {%0A07:09:20.616 STDOUT [aws] terraform:       + arn               = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:       + id                = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:       + log_group_class   = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:       + name              = "/aws/ecs/openmetadata-airflow"%0A07:09:20.616 STDOUT [aws] terraform:       + name_prefix       = (known after apply)%0A07:09:20.616 STDOUT [aws] terraform:       + region            = "ap-northeast-1"%0A07:09:20.617 STDOUT [aws] terraform:       + retention_in_days = 30%0A07:09:20.617 STDOUT [aws] terraform:       + skip_destroy      = false%0A07:09:20.617 STDOUT [aws] terraform:       + tags_all          = (known after apply)%0A07:09:20.617 STDOUT [aws] terraform:     }%0A07:09:20.617 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.openmetadata_server will be created%0A07:09:20.617 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "openmetadata_server" {%0A07:09:20.617 STDOUT [aws] terraform:       + arn               = (known after apply)%0A07:09:20.617 STDOUT [aws] terraform:       + id                = (known after apply)%0A07:09:20.617 STDOUT [aws] terraform:       + log_group_class   = (known after apply)%0A07:09:20.617 STDOUT [aws] terraform:       + name              = "/aws/ecs/openmetadata-server"%0A07:09:20.617 STDOUT [aws] terraform:       + name_prefix       = (known after apply)%0A07:09:20.617 STDOUT [aws] terraform:       + region            = "ap-northeast-1"%0A07:09:20.617 STDOUT [aws] terraform:       + retention_in_days = 30%0A07:09:20.617 STDOUT [aws] terraform:       + skip_destroy      = false%0A07:09:20.617 STDOUT [aws] terraform:       + tags_all          = (known after apply)%0A07:09:20.617 STDOUT [aws] terraform:     }%0A07:09:20.617 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["elasticsearch"] will be created%0A07:09:20.617 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {%0A07:09:20.617 STDOUT [aws] terraform:       + arn                  = (known after apply)%0A07:09:20.618 STDOUT [aws] terraform:       + force_delete         = true%0A07:09:20.618 STDOUT [aws] terraform:       + id                   = (known after apply)%0A07:09:20.618 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"%0A07:09:20.618 STDOUT [aws] terraform:       + name                 = "elasticsearch"%0A07:09:20.618 STDOUT [aws] terraform:       + region               = "ap-northeast-1"%0A07:09:20.618 STDOUT [aws] terraform:       + registry_id          = (known after apply)%0A07:09:20.618 STDOUT [aws] terraform:       + repository_url       = (known after apply)%0A07:09:20.618 STDOUT [aws] terraform:       + tags_all             = (known after apply)%0A07:09:20.618 STDOUT [aws] terraform:       + encryption_configuration {%0A07:09:20.618 STDOUT [aws] terraform:           + encryption_type = "KMS"%0A07:09:20.618 STDOUT [aws] terraform:           + kms_key         = (known after apply)%0A07:09:20.618 STDOUT [aws] terraform:         }%0A07:09:20.618 STDOUT [aws] terraform:       + image_scanning_configuration {%0A07:09:20.618 STDOUT [aws] terraform:           + scan_on_push = true%0A07:09:20.618 STDOUT [aws] terraform:         }%0A07:09:20.618 STDOUT [aws] terraform:     }%0A07:09:20.618 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["openmetadata/ingestion"] will be created%0A07:09:20.618 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {%0A07:09:20.618 STDOUT [aws] terraform:       + arn                  = (known after apply)%0A07:09:20.618 STDOUT [aws] terraform:       + force_delete         = true%0A07:09:20.619 STDOUT [aws] terraform:       + id                   = (known after apply)%0A07:09:20.619 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"%0A07:09:20.619 STDOUT [aws] terraform:       + name                 = "openmetadata/ingestion"%0A07:09:20.619 STDOUT [aws] terraform:       + region               = "ap-northeast-1"%0A07:09:20.619 STDOUT [aws] terraform:       + registry_id          = (known after apply)%0A07:09:20.619 STDOUT [aws] terraform:       + repository_url       = (known after apply)%0A07:09:20.619 STDOUT [aws] terraform:       + tags_all             = (known after apply)%0A07:09:20.619 STDOUT [aws] terraform:       + encryption_configuration {%0A07:09:20.619 STDOUT [aws] terraform:           + encryption_type = "KMS"%0A07:09:20.619 STDOUT [aws] terraform:           + kms_key         = (known after apply)%0A07:09:20.619 STDOUT [aws] terraform:         }%0A07:09:20.619 STDOUT [aws] terraform:       + image_scanning_configuration {%0A07:09:20.619 STDOUT [aws] terraform:           + scan_on_push = true%0A07:09:20.619 STDOUT [aws] terraform:         }%0A07:09:20.619 STDOUT [aws] terraform:     }%0A07:09:20.619 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["openmetadata/server"] will be created%0A07:09:20.619 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {%0A07:09:20.619 STDOUT [aws] terraform:       + arn                  = (known after apply)%0A07:09:20.619 STDOUT [aws] terraform:       + force_delete         = true%0A07:09:20.619 STDOUT [aws] terraform:       + id                   = (known after apply)%0A07:09:20.620 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"%0A07:09:20.620 STDOUT [aws] terraform:       + name                 = "openmetadata/server"%0A07:09:20.620 STDOUT [aws] terraform:       + region               = "ap-northeast-1"%0A07:09:20.620 STDOUT [aws] terraform:       + registry_id          = (known after apply)%0A07:09:20.620 STDOUT [aws] terraform:       + repository_url       = (known after apply)%0A07:09:20.620 STDOUT [aws] terraform:       + tags_all             = (known after apply)%0A07:09:20.620 STDOUT [aws] terraform:       + encryption_configuration {%0A07:09:20.620 STDOUT [aws] terraform:           + encryption_type = "KMS"%0A07:09:20.620 STDOUT [aws] terraform:           + kms_key         = (known after apply)%0A07:09:20.620 STDOUT [aws] terraform:         }%0A07:09:20.620 STDOUT [aws] terraform:       + image_scanning_configuration {%0A07:09:20.620 STDOUT [aws] terraform:           + scan_on_push = true%0A07:09:20.620 STDOUT [aws] terraform:         }%0A07:09:20.620 STDOUT [aws] terraform:     }%0A07:09:20.620 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_elasticsearch_image will be created%0A07:09:20.620 STDOUT [aws] terraform:   + resource "terraform_data" "build_elasticsearch_image" {%0A07:09:20.620 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.620 STDOUT [aws] terraform:       + triggers_replace = [%0A07:09:20.620 STDOUT [aws] terraform:           + (known after apply),%0A07:09:20.620 STDOUT [aws] terraform:           + "c9003c196f68e069fb45d38807c53efbc20f94cf847c57f051be7999cbf09b1e",%0A07:09:20.621 STDOUT [aws] terraform:         ]%0A07:09:20.621 STDOUT [aws] terraform:     }%0A07:09:20.621 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_ingestion_image will be created%0A07:09:20.621 STDOUT [aws] terraform:   + resource "terraform_data" "build_ingestion_image" {%0A07:09:20.621 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.621 STDOUT [aws] terraform:       + triggers_replace = [%0A07:09:20.621 STDOUT [aws] terraform:           + (known after apply),%0A07:09:20.621 STDOUT [aws] terraform:           + "e1bfbafc82b47fac9fbe5245f2c3bca0cd327c6109238bcab90ad51454afb2ea",%0A07:09:20.621 STDOUT [aws] terraform:         ]%0A07:09:20.621 STDOUT [aws] terraform:     }%0A07:09:20.621 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_openmetadata_image will be created%0A07:09:20.621 STDOUT [aws] terraform:   + resource "terraform_data" "build_openmetadata_image" {%0A07:09:20.621 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.621 STDOUT [aws] terraform:       + triggers_replace = [%0A07:09:20.621 STDOUT [aws] terraform:           + (known after apply),%0A07:09:20.621 STDOUT [aws] terraform:           + "903d0b55506275d7148cc42ea4d4a9dffb884c8975891b0ca720ddebc6926088",%0A07:09:20.621 STDOUT [aws] terraform:         ]%0A07:09:20.621 STDOUT [aws] terraform:     }%0A07:09:20.621 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_cluster.this will be created%0A07:09:20.621 STDOUT [aws] terraform:   + resource "aws_ecs_cluster" "this" {%0A07:09:20.621 STDOUT [aws] terraform:       + arn      = (known after apply)%0A07:09:20.622 STDOUT [aws] terraform:       + id       = (known after apply)%0A07:09:20.622 STDOUT [aws] terraform:       + name     = "ethan-dev-ecs-apne1-cluster"%0A07:09:20.622 STDOUT [aws] terraform:       + region   = "ap-northeast-1"%0A07:09:20.622 STDOUT [aws] terraform:       + tags_all = (known after apply)%0A07:09:20.622 STDOUT [aws] terraform:       + setting {%0A07:09:20.622 STDOUT [aws] terraform:           + name  = "containerInsights"%0A07:09:20.622 STDOUT [aws] terraform:           + value = "enabled"%0A07:09:20.622 STDOUT [aws] terraform:         }%0A07:09:20.622 STDOUT [aws] terraform:     }%0A07:09:20.622 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_service.this will be created%0A07:09:20.622 STDOUT [aws] terraform:   + resource "aws_ecs_service" "this" {%0A07:09:20.622 STDOUT [aws] terraform:       + arn                                = (known after apply)%0A07:09:20.622 STDOUT [aws] terraform:       + availability_zone_rebalancing      = "DISABLED"%0A07:09:20.622 STDOUT [aws] terraform:       + cluster                            = (known after apply)%0A07:09:20.622 STDOUT [aws] terraform:       + deployment_maximum_percent         = 200%0A07:09:20.622 STDOUT [aws] terraform:       + deployment_minimum_healthy_percent = 100%0A07:09:20.622 STDOUT [aws] terraform:       + desired_count                      = 1%0A07:09:20.622 STDOUT [aws] terraform:       + enable_ecs_managed_tags            = false%0A07:09:20.622 STDOUT [aws] terraform:       + enable_execute_command             = true%0A07:09:20.622 STDOUT [aws] terraform:       + iam_role                           = (known after apply)%0A07:09:20.623 STDOUT [aws] terraform:       + id                                 = (known after apply)%0A07:09:20.623 STDOUT [aws] terraform:       + launch_type                        = "FARGATE"%0A07:09:20.623 STDOUT [aws] terraform:       + name                               = "openmetadata-service"%0A07:09:20.623 STDOUT [aws] terraform:       + platform_version                   = "LATEST"%0A07:09:20.623 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"%0A07:09:20.623 STDOUT [aws] terraform:       + scheduling_strategy                = "REPLICA"%0A07:09:20.623 STDOUT [aws] terraform:       + tags_all                           = (known after apply)%0A07:09:20.623 STDOUT [aws] terraform:       + task_definition                    = (known after apply)%0A07:09:20.623 STDOUT [aws] terraform:       + triggers                           = (known after apply)%0A07:09:20.623 STDOUT [aws] terraform:       + wait_for_steady_state              = true%0A07:09:20.623 STDOUT [aws] terraform:       + load_balancer {%0A07:09:20.623 STDOUT [aws] terraform:           + container_name   = "openmetadata_server"%0A07:09:20.623 STDOUT [aws] terraform:           + container_port   = 8585%0A07:09:20.623 STDOUT [aws] terraform:           + target_group_arn = (known after apply)%0A07:09:20.623 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)%0A07:09:20.624 STDOUT [aws] terraform:         }%0A07:09:20.624 STDOUT [aws] terraform:       + network_configuration {%0A07:09:20.624 STDOUT [aws] terraform:           + assign_public_ip = false%0A07:09:20.624 STDOUT [aws] terraform:           + security_groups  = (known after apply)%0A07:09:20.624 STDOUT [aws] terraform:           + subnets          = (known after apply)%0A07:09:20.624 STDOUT [aws] terraform:         }%0A07:09:20.624 STDOUT [aws] terraform:     }%0A07:09:20.624 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_task_definition.openmetadata will be created%0A07:09:20.624 STDOUT [aws] terraform:   + resource "aws_ecs_task_definition" "openmetadata" {%0A07:09:20.624 STDOUT [aws] terraform:       + arn                      = (known after apply)%0A07:09:20.624 STDOUT [aws] terraform:       + arn_without_revision     = (known after apply)%0A07:09:20.624 STDOUT [aws] terraform:       + container_definitions    = (sensitive value)%0A07:09:20.624 STDOUT [aws] terraform:       + cpu                      = "8192"%0A07:09:20.624 STDOUT [aws] terraform:       + enable_fault_injection   = (known after apply)%0A07:09:20.624 STDOUT [aws] terraform:       + execution_role_arn       = (known after apply)%0A07:09:20.624 STDOUT [aws] terraform:       + family                   = "openmetadata"%0A07:09:20.624 STDOUT [aws] terraform:       + id                       = (known after apply)%0A07:09:20.624 STDOUT [aws] terraform:       + memory                   = "16384"%0A07:09:20.624 STDOUT [aws] terraform:       + network_mode             = "awsvpc"%0A07:09:20.625 STDOUT [aws] terraform:       + region                   = "ap-northeast-1"%0A07:09:20.625 STDOUT [aws] terraform:       + requires_compatibilities = [%0A07:09:20.625 STDOUT [aws] terraform:           + "FARGATE",%0A07:09:20.625 STDOUT [aws] terraform:         ]%0A07:09:20.625 STDOUT [aws] terraform:       + revision                 = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + skip_destroy             = false%0A07:09:20.625 STDOUT [aws] terraform:       + tags_all                 = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + task_role_arn            = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + track_latest             = false%0A07:09:20.625 STDOUT [aws] terraform:       + ephemeral_storage {%0A07:09:20.625 STDOUT [aws] terraform:           + size_in_gib = 60%0A07:09:20.625 STDOUT [aws] terraform:         }%0A07:09:20.625 STDOUT [aws] terraform:       + runtime_platform {%0A07:09:20.625 STDOUT [aws] terraform:           + operating_system_family = "LINUX"%0A07:09:20.625 STDOUT [aws] terraform:         }%0A07:09:20.625 STDOUT [aws] terraform:     }%0A07:09:20.625 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_policy.ecs_task will be created%0A07:09:20.625 STDOUT [aws] terraform:   + resource "aws_iam_policy" "ecs_task" {%0A07:09:20.625 STDOUT [aws] terraform:       + arn              = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + attachment_count = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + name             = "ethan-dev-policy-apne1-ecs-task"%0A07:09:20.625 STDOUT [aws] terraform:       + name_prefix      = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + path             = "/"%0A07:09:20.625 STDOUT [aws] terraform:       + policy           = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + policy_id        = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + tags_all         = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:     }%0A07:09:20.625 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_policy.ecs_task_execution will be created%0A07:09:20.625 STDOUT [aws] terraform:   + resource "aws_iam_policy" "ecs_task_execution" {%0A07:09:20.625 STDOUT [aws] terraform:       + arn              = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + attachment_count = (known after apply)%0A07:09:20.625 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.626 STDOUT [aws] terraform:       + name             = "ethan-dev-policy-apne1-ecs-task-execution"%0A07:09:20.626 STDOUT [aws] terraform:       + name_prefix      = (known after apply)%0A07:09:20.626 STDOUT [aws] terraform:       + path             = "/"%0A07:09:20.626 STDOUT [aws] terraform:       + policy           = (known after apply)%0A07:09:20.626 STDOUT [aws] terraform:       + policy_id        = (known after apply)%0A07:09:20.626 STDOUT [aws] terraform:       + tags_all         = (known after apply)%0A07:09:20.626 STDOUT [aws] terraform:     }%0A07:09:20.626 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role.ecs_task will be created%0A07:09:20.626 STDOUT [aws] terraform:   + resource "aws_iam_role" "ecs_task" {%0A07:09:20.626 STDOUT [aws] terraform:       + arn                   = (known after apply)%0A07:09:20.626 STDOUT [aws] terraform:       + assume_role_policy    = jsonencode(%0A07:09:20.626 STDOUT [aws] terraform:             {%0A07:09:20.626 STDOUT [aws] terraform:               + Statement = [%0A07:09:20.626 STDOUT [aws] terraform:                   + {%0A07:09:20.626 STDOUT [aws] terraform:                       + Action    = "sts:AssumeRole"%0A07:09:20.626 STDOUT [aws] terraform:                       + Condition = {%0A07:09:20.626 STDOUT [aws] terraform:                           + ArnLike      = {%0A07:09:20.627 STDOUT [aws] terraform:                               + "aws:SourceArn" = "arn:aws:ecs:ap-northeast-1:921407950230:*"%0A07:09:20.627 STDOUT [aws] terraform:                             }%0A07:09:20.627 STDOUT [aws] terraform:                           + StringEquals = {%0A07:09:20.627 STDOUT [aws] terraform:                               + "aws:SourceAccount" = "921407950230"%0A07:09:20.627 STDOUT [aws] terraform:                             }%0A07:09:20.627 STDOUT [aws] terraform:                         }%0A07:09:20.627 STDOUT [aws] terraform:                       + Effect    = "Allow"%0A07:09:20.627 STDOUT [aws] terraform:                       + Principal = {%0A07:09:20.627 STDOUT [aws] terraform:                           + Service = [%0A07:09:20.627 STDOUT [aws] terraform:                               + "ecs-tasks.amazonaws.com",%0A07:09:20.627 STDOUT [aws] terraform:                             ]%0A07:09:20.627 STDOUT [aws] terraform:                         }%0A07:09:20.627 STDOUT [aws] terraform:                     },%0A07:09:20.627 STDOUT [aws] terraform:                 ]%0A07:09:20.627 STDOUT [aws] terraform:               + Version   = "2012-10-17"%0A07:09:20.627 STDOUT [aws] terraform:             }%0A07:09:20.627 STDOUT [aws] terraform:         )%0A07:09:20.627 STDOUT [aws] terraform:       + create_date           = (known after apply)%0A07:09:20.627 STDOUT [aws] terraform:       + force_detach_policies = false%0A07:09:20.627 STDOUT [aws] terraform:       + id                    = (known after apply)%0A07:09:20.627 STDOUT [aws] terraform:       + managed_policy_arns   = (known after apply)%0A07:09:20.627 STDOUT [aws] terraform:       + max_session_duration  = 3600%0A07:09:20.628 STDOUT [aws] terraform:       + name                  = "ethan-dev-role-apne1-ecs-task"%0A07:09:20.628 STDOUT [aws] terraform:       + name_prefix           = (known after apply)%0A07:09:20.628 STDOUT [aws] terraform:       + path                  = "/"%0A07:09:20.628 STDOUT [aws] terraform:       + tags_all              = (known after apply)%0A07:09:20.628 STDOUT [aws] terraform:       + unique_id             = (known after apply)%0A07:09:20.628 STDOUT [aws] terraform:       + inline_policy (known after apply)%0A07:09:20.628 STDOUT [aws] terraform:     }%0A07:09:20.628 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role.ecs_task_execution will be created%0A07:09:20.628 STDOUT [aws] terraform:   + resource "aws_iam_role" "ecs_task_execution" {%0A07:09:20.628 STDOUT [aws] terraform:       + arn                   = (known after apply)%0A07:09:20.628 STDOUT [aws] terraform:       + assume_role_policy    = jsonencode(%0A07:09:20.628 STDOUT [aws] terraform:             {%0A07:09:20.628 STDOUT [aws] terraform:               + Statement = [%0A07:09:20.628 STDOUT [aws] terraform:                   + {%0A07:09:20.628 STDOUT [aws] terraform:                       + Action    = "sts:AssumeRole"%0A07:09:20.628 STDOUT [aws] terraform:                       + Effect    = "Allow"%0A07:09:20.628 STDOUT [aws] terraform:                       + Principal = {%0A07:09:20.628 STDOUT [aws] terraform:                           + Service = "ecs-tasks.amazonaws.com"%0A07:09:20.629 STDOUT [aws] terraform:                         }%0A07:09:20.629 STDOUT [aws] terraform:                       + Sid       = ""%0A07:09:20.629 STDOUT [aws] terraform:                     },%0A07:09:20.629 STDOUT [aws] terraform:                 ]%0A07:09:20.629 STDOUT [aws] terraform:               + Version   = "2012-10-17"%0A07:09:20.629 STDOUT [aws] terraform:             }%0A07:09:20.629 STDOUT [aws] terraform:         )%0A07:09:20.629 STDOUT [aws] terraform:       + create_date           = (known after apply)%0A07:09:20.629 STDOUT [aws] terraform:       + force_detach_policies = false%0A07:09:20.629 STDOUT [aws] terraform:       + id                    = (known after apply)%0A07:09:20.629 STDOUT [aws] terraform:       + managed_policy_arns   = (known after apply)%0A07:09:20.629 STDOUT [aws] terraform:       + max_session_duration  = 3600%0A07:09:20.629 STDOUT [aws] terraform:       + name                  = "ethan-dev-role-apne1-ecs-task-execution"%0A07:09:20.629 STDOUT [aws] terraform:       + name_prefix           = (known after apply)%0A07:09:20.629 STDOUT [aws] terraform:       + path                  = "/"%0A07:09:20.629 STDOUT [aws] terraform:       + tags_all              = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + unique_id             = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + inline_policy (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:     }%0A07:09:20.630 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role_policy_attachment.ecs_task will be created%0A07:09:20.630 STDOUT [aws] terraform:   + resource "aws_iam_role_policy_attachment" "ecs_task" {%0A07:09:20.630 STDOUT [aws] terraform:       + id         = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + policy_arn = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + role       = "ethan-dev-role-apne1-ecs-task"%0A07:09:20.630 STDOUT [aws] terraform:     }%0A07:09:20.630 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role_policy_attachment.ecs_task_execution will be created%0A07:09:20.630 STDOUT [aws] terraform:   + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {%0A07:09:20.630 STDOUT [aws] terraform:       + id         = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + policy_arn = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + role       = "ethan-dev-role-apne1-ecs-task-execution"%0A07:09:20.630 STDOUT [aws] terraform:     }%0A07:09:20.630 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.aurora will be created%0A07:09:20.630 STDOUT [aws] terraform:   + resource "aws_kms_alias" "aurora" {%0A07:09:20.630 STDOUT [aws] terraform:       + arn            = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + id             = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-aurora"%0A07:09:20.630 STDOUT [aws] terraform:       + name_prefix    = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + region         = "ap-northeast-1"%0A07:09:20.630 STDOUT [aws] terraform:       + target_key_arn = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + target_key_id  = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:     }%0A07:09:20.630 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.ecr will be created%0A07:09:20.630 STDOUT [aws] terraform:   + resource "aws_kms_alias" "ecr" {%0A07:09:20.630 STDOUT [aws] terraform:       + arn            = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + id             = (known after apply)%0A07:09:20.630 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-ecr"%0A07:09:20.630 STDOUT [aws] terraform:       + name_prefix    = (known after apply)%0A07:09:20.631 STDOUT [aws] terraform:       + region         = "ap-northeast-1"%0A07:09:20.631 STDOUT [aws] terraform:       + target_key_arn = (known after apply)%0A07:09:20.631 STDOUT [aws] terraform:       + target_key_id  = (known after apply)%0A07:09:20.631 STDOUT [aws] terraform:     }%0A07:09:20.631 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.s3 will be created%0A07:09:20.631 STDOUT [aws] terraform:   + resource "aws_kms_alias" "s3" {%0A07:09:20.631 STDOUT [aws] terraform:       + arn            = (known after apply)%0A07:09:20.631 STDOUT [aws] terraform:       + id             = (known after apply)%0A07:09:20.631 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-s3-envfile"%0A07:09:20.631 STDOUT [aws] terraform:       + name_prefix    = (known after apply)%0A07:09:20.631 STDOUT [aws] terraform:       + region         = "ap-northeast-1"%0A07:09:20.631 STDOUT [aws] terraform:       + target_key_arn = (known after apply)%0A07:09:20.631 STDOUT [aws] terraform:       + target_key_id  = (known after apply)%0A07:09:20.631 STDOUT [aws] terraform:     }%0A07:09:20.631 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.aurora will be created%0A07:09:20.631 STDOUT [aws] terraform:   + resource "aws_kms_key" "aurora" {%0A07:09:20.631 STDOUT [aws] terraform:       + arn                                = (known after apply)%0A07:09:20.632 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false%0A07:09:20.632 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A07:09:20.632 STDOUT [aws] terraform:       + deletion_window_in_days            = 7%0A07:09:20.632 STDOUT [aws] terraform:       + description                        = "For Aurora"%0A07:09:20.632 STDOUT [aws] terraform:       + enable_key_rotation                = true%0A07:09:20.632 STDOUT [aws] terraform:       + id                                 = (known after apply)%0A07:09:20.632 STDOUT [aws] terraform:       + is_enabled                         = true%0A07:09:20.632 STDOUT [aws] terraform:       + key_id                             = (known after apply)%0A07:09:20.632 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"%0A07:09:20.632 STDOUT [aws] terraform:       + multi_region                       = (known after apply)%0A07:09:20.632 STDOUT [aws] terraform:       + policy                             = (known after apply)%0A07:09:20.632 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"%0A07:09:20.632 STDOUT [aws] terraform:       + rotation_period_in_days            = 365%0A07:09:20.632 STDOUT [aws] terraform:       + tags                               = {%0A07:09:20.632 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-aurora"%0A07:09:20.632 STDOUT [aws] terraform:         }%0A07:09:20.633 STDOUT [aws] terraform:       + tags_all                           = {%0A07:09:20.633 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-aurora"%0A07:09:20.633 STDOUT [aws] terraform:         }%0A07:09:20.633 STDOUT [aws] terraform:     }%0A07:09:20.633 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.ecr will be created%0A07:09:20.633 STDOUT [aws] terraform:   + resource "aws_kms_key" "ecr" {%0A07:09:20.633 STDOUT [aws] terraform:       + arn                                = (known after apply)%0A07:09:20.633 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false%0A07:09:20.633 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A07:09:20.633 STDOUT [aws] terraform:       + deletion_window_in_days            = 7%0A07:09:20.633 STDOUT [aws] terraform:       + description                        = "For ECR"%0A07:09:20.633 STDOUT [aws] terraform:       + enable_key_rotation                = true%0A07:09:20.633 STDOUT [aws] terraform:       + id                                 = (known after apply)%0A07:09:20.633 STDOUT [aws] terraform:       + is_enabled                         = true%0A07:09:20.633 STDOUT [aws] terraform:       + key_id                             = (known after apply)%0A07:09:20.633 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"%0A07:09:20.633 STDOUT [aws] terraform:       + multi_region                       = (known after apply)%0A07:09:20.634 STDOUT [aws] terraform:       + policy                             = (known after apply)%0A07:09:20.634 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"%0A07:09:20.634 STDOUT [aws] terraform:       + rotation_period_in_days            = 365%0A07:09:20.634 STDOUT [aws] terraform:       + tags                               = {%0A07:09:20.634 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-ecr"%0A07:09:20.634 STDOUT [aws] terraform:         }%0A07:09:20.634 STDOUT [aws] terraform:       + tags_all                           = {%0A07:09:20.634 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-ecr"%0A07:09:20.634 STDOUT [aws] terraform:         }%0A07:09:20.634 STDOUT [aws] terraform:     }%0A07:09:20.634 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.s3 will be created%0A07:09:20.634 STDOUT [aws] terraform:   + resource "aws_kms_key" "s3" {%0A07:09:20.634 STDOUT [aws] terraform:       + arn                                = (known after apply)%0A07:09:20.634 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false%0A07:09:20.634 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A07:09:20.634 STDOUT [aws] terraform:       + deletion_window_in_days            = 7%0A07:09:20.634 STDOUT [aws] terraform:       + description                        = "For s3"%0A07:09:20.635 STDOUT [aws] terraform:       + enable_key_rotation                = true%0A07:09:20.635 STDOUT [aws] terraform:       + id                                 = (known after apply)%0A07:09:20.635 STDOUT [aws] terraform:       + is_enabled                         = true%0A07:09:20.635 STDOUT [aws] terraform:       + key_id                             = (known after apply)%0A07:09:20.635 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"%0A07:09:20.635 STDOUT [aws] terraform:       + multi_region                       = (known after apply)%0A07:09:20.635 STDOUT [aws] terraform:       + policy                             = (known after apply)%0A07:09:20.635 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"%0A07:09:20.635 STDOUT [aws] terraform:       + rotation_period_in_days            = 365%0A07:09:20.635 STDOUT [aws] terraform:       + tags                               = {%0A07:09:20.635 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-s3-envfile"%0A07:09:20.635 STDOUT [aws] terraform:         }%0A07:09:20.635 STDOUT [aws] terraform:       + tags_all                           = {%0A07:09:20.635 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-s3-envfile"%0A07:09:20.635 STDOUT [aws] terraform:         }%0A07:09:20.635 STDOUT [aws] terraform:     }%0A07:09:20.635 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb.this will be created%0A07:09:20.636 STDOUT [aws] terraform:   + resource "aws_lb" "this" {%0A07:09:20.636 STDOUT [aws] terraform:       + arn                                                          = (known after apply)%0A07:09:20.636 STDOUT [aws] terraform:       + arn_suffix                                                   = (known after apply)%0A07:09:20.636 STDOUT [aws] terraform:       + client_keep_alive                                            = 3600%0A07:09:20.636 STDOUT [aws] terraform:       + desync_mitigation_mode                                       = "defensive"%0A07:09:20.636 STDOUT [aws] terraform:       + dns_name                                                     = (known after apply)%0A07:09:20.636 STDOUT [aws] terraform:       + drop_invalid_header_fields                                   = true%0A07:09:20.636 STDOUT [aws] terraform:       + enable_deletion_protection                                   = false%0A07:09:20.636 STDOUT [aws] terraform:       + enable_http2                                                 = true%0A07:09:20.636 STDOUT [aws] terraform:       + enable_tls_version_and_cipher_suite_headers                  = false%0A07:09:20.636 STDOUT [aws] terraform:       + enable_waf_fail_open                                         = false%0A07:09:20.636 STDOUT [aws] terraform:       + enable_xff_client_port                                       = false%0A07:09:20.637 STDOUT [aws] terraform:       + enable_zonal_shift                                           = false%0A07:09:20.637 STDOUT [aws] terraform:       + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A07:09:20.637 STDOUT [aws] terraform:       + id                                                           = (known after apply)%0A07:09:20.637 STDOUT [aws] terraform:       + idle_timeout                                                 = 60%0A07:09:20.637 STDOUT [aws] terraform:       + internal                                                     = (known after apply)%0A07:09:20.637 STDOUT [aws] terraform:       + ip_address_type                                              = (known after apply)%0A07:09:20.637 STDOUT [aws] terraform:       + load_balancer_type                                           = "application"%0A07:09:20.637 STDOUT [aws] terraform:       + name                                                         = "ethan-dev-alb-apne1"%0A07:09:20.637 STDOUT [aws] terraform:       + name_prefix                                                  = (known after apply)%0A07:09:20.637 STDOUT [aws] terraform:       + preserve_host_header                                         = false%0A07:09:20.637 STDOUT [aws] terraform:       + region                                                       = "ap-northeast-1"%0A07:09:20.637 STDOUT [aws] terraform:       + security_groups                                              = (known after apply)%0A07:09:20.638 STDOUT [aws] terraform:       + subnets                                                      = (known after apply)%0A07:09:20.638 STDOUT [aws] terraform:       + tags_all                                                     = (known after apply)%0A07:09:20.638 STDOUT [aws] terraform:       + vpc_id                                                       = (known after apply)%0A07:09:20.638 STDOUT [aws] terraform:       + xff_header_processing_mode                                   = "append"%0A07:09:20.638 STDOUT [aws] terraform:       + zone_id                                                      = (known after apply)%0A07:09:20.638 STDOUT [aws] terraform:       + subnet_mapping (known after apply)%0A07:09:20.638 STDOUT [aws] terraform:     }%0A07:09:20.638 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb_listener.from_https will be created%0A07:09:20.638 STDOUT [aws] terraform:   + resource "aws_lb_listener" "from_https" {%0A07:09:20.638 STDOUT [aws] terraform:       + arn                                                                   = (known after apply)%0A07:09:20.638 STDOUT [aws] terraform:       + certificate_arn                                                       = "arn:aws:acm:ap-northeast-1:000000000000:certificate/mock"%0A07:09:20.638 STDOUT [aws] terraform:       + id                                                                    = (known after apply)%0A07:09:20.638 STDOUT [aws] terraform:       + load_balancer_arn                                                     = (known after apply)%0A07:09:20.639 STDOUT [aws] terraform:       + port                                                                  = 443%0A07:09:20.639 STDOUT [aws] terraform:       + protocol                                                              = "HTTPS"%0A07:09:20.639 STDOUT [aws] terraform:       + region                                                                = "ap-northeast-1"%0A07:09:20.639 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A07:09:20.639 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A07:09:20.639 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A07:09:20.639 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A07:09:20.639 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A07:09:20.639 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A07:09:20.639 STDOUT [aws] terraform:       + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A07:09:20.639 STDOUT [aws] terraform:       + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_content_security_policy_header_value            = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_server_enabled                                  = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A07:09:20.640 STDOUT [aws] terraform:       + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:       + ssl_policy                                                            = (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:       + tags_all                                                              = (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:       + tcp_idle_timeout_seconds                                              = (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:       + default_action {%0A07:09:20.641 STDOUT [aws] terraform:           + order            = (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:           + target_group_arn = (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:           + type             = "forward"%0A07:09:20.641 STDOUT [aws] terraform:         }%0A07:09:20.641 STDOUT [aws] terraform:       + mutual_authentication (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:     }%0A07:09:20.641 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb_target_group.to_openmetadata will be created%0A07:09:20.641 STDOUT [aws] terraform:   + resource "aws_lb_target_group" "to_openmetadata" {%0A07:09:20.641 STDOUT [aws] terraform:       + arn                                = (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:       + arn_suffix                         = (known after apply)%0A07:09:20.641 STDOUT [aws] terraform:       + connection_termination             = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + deregistration_delay               = "300"%0A07:09:20.642 STDOUT [aws] terraform:       + id                                 = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + ip_address_type                    = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + lambda_multi_value_headers_enabled = false%0A07:09:20.642 STDOUT [aws] terraform:       + load_balancer_arns                 = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + load_balancing_algorithm_type      = "least_outstanding_requests"%0A07:09:20.642 STDOUT [aws] terraform:       + load_balancing_anomaly_mitigation  = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + load_balancing_cross_zone_enabled  = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + name                               = "openmetadata-tg"%0A07:09:20.642 STDOUT [aws] terraform:       + name_prefix                        = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + port                               = 8585%0A07:09:20.642 STDOUT [aws] terraform:       + preserve_client_ip                 = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + protocol                           = "HTTP"%0A07:09:20.642 STDOUT [aws] terraform:       + protocol_version                   = (known after apply)%0A07:09:20.642 STDOUT [aws] terraform:       + proxy_protocol_v2                  = false%0A07:09:20.643 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"%0A07:09:20.643 STDOUT [aws] terraform:       + slow_start                         = 0%0A07:09:20.643 STDOUT [aws] terraform:       + tags_all                           = (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:       + target_type                        = "ip"%0A07:09:20.643 STDOUT [aws] terraform:       + vpc_id                             = (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:       + health_check (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:       + stickiness {%0A07:09:20.643 STDOUT [aws] terraform:           + cookie_duration = 86400%0A07:09:20.643 STDOUT [aws] terraform:           + enabled         = true%0A07:09:20.643 STDOUT [aws] terraform:           + type            = "lb_cookie"%0A07:09:20.643 STDOUT [aws] terraform:         }%0A07:09:20.643 STDOUT [aws] terraform:       + target_failover (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:       + target_group_health (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:       + target_health_state (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:     }%0A07:09:20.643 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_route53_record.alb_a_record will be created%0A07:09:20.643 STDOUT [aws] terraform:   + resource "aws_route53_record" "alb_a_record" {%0A07:09:20.643 STDOUT [aws] terraform:       + allow_overwrite = (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:       + fqdn            = (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:       + id              = (known after apply)%0A07:09:20.643 STDOUT [aws] terraform:       + name            = "ethan-example.com"%0A07:09:20.643 STDOUT [aws] terraform:       + type            = "A"%0A07:09:20.643 STDOUT [aws] terraform:       + zone_id         = "Z111111111111"%0A07:09:20.644 STDOUT [aws] terraform:       + alias {%0A07:09:20.644 STDOUT [aws] terraform:           + evaluate_target_health = true%0A07:09:20.644 STDOUT [aws] terraform:           + name                   = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:           + zone_id                = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:         }%0A07:09:20.644 STDOUT [aws] terraform:     }%0A07:09:20.644 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket.this will be created%0A07:09:20.644 STDOUT [aws] terraform:   + resource "aws_s3_bucket" "this" {%0A07:09:20.644 STDOUT [aws] terraform:       + acceleration_status         = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:       + acl                         = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:       + arn                         = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:       + bucket                      = "ethan-dev-s3-apne1-docker-envfile"%0A07:09:20.644 STDOUT [aws] terraform:       + bucket_domain_name          = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:       + bucket_prefix               = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:       + bucket_region               = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:       + bucket_regional_domain_name = (known after apply)%0A07:09:20.644 STDOUT [aws] terraform:       + force_destroy               = false%0A07:09:20.645 STDOUT [aws] terraform:       + hosted_zone_id              = (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + id                          = (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + object_lock_enabled         = (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + policy                      = (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + region                      = "ap-northeast-1"%0A07:09:20.645 STDOUT [aws] terraform:       + request_payer               = (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + tags                        = {%0A07:09:20.645 STDOUT [aws] terraform:           + "Name" = "ethan-dev-s3-apne1-docker-envfile"%0A07:09:20.645 STDOUT [aws] terraform:         }%0A07:09:20.645 STDOUT [aws] terraform:       + tags_all                    = {%0A07:09:20.645 STDOUT [aws] terraform:           + "Name" = "ethan-dev-s3-apne1-docker-envfile"%0A07:09:20.645 STDOUT [aws] terraform:         }%0A07:09:20.645 STDOUT [aws] terraform:       + website_domain              = (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + website_endpoint            = (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + cors_rule (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + grant (known after apply)%0A07:09:20.645 STDOUT [aws] terraform:       + lifecycle_rule (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + logging (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + object_lock_configuration (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + replication_configuration (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + server_side_encryption_configuration (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + versioning (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + website (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:     }%0A07:09:20.646 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_policy.this will be created%0A07:09:20.646 STDOUT [aws] terraform:   + resource "aws_s3_bucket_policy" "this" {%0A07:09:20.646 STDOUT [aws] terraform:       + bucket = (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + id     = (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + policy = (known after apply)%0A07:09:20.646 STDOUT [aws] terraform:       + region = "ap-northeast-1"%0A07:09:20.646 STDOUT [aws] terraform:     }%0A07:09:20.646 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_public_access_block.this will be created%0A07:09:20.646 STDOUT [aws] terraform:   + resource "aws_s3_bucket_public_access_block" "this" {%0A07:09:20.646 STDOUT [aws] terraform:       + block_public_acls       = true%0A07:09:20.646 STDOUT [aws] terraform:       + block_public_policy     = true%0A07:09:20.647 STDOUT [aws] terraform:       + bucket                  = (known after apply)%0A07:09:20.647 STDOUT [aws] terraform:       + id                      = (known after apply)%0A07:09:20.647 STDOUT [aws] terraform:       + ignore_public_acls      = true%0A07:09:20.647 STDOUT [aws] terraform:       + region                  = "ap-northeast-1"%0A07:09:20.647 STDOUT [aws] terraform:       + restrict_public_buckets = true%0A07:09:20.647 STDOUT [aws] terraform:     }%0A07:09:20.647 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_server_side_encryption_configuration.this will be created%0A07:09:20.647 STDOUT [aws] terraform:   + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {%0A07:09:20.647 STDOUT [aws] terraform:       + bucket = (known after apply)%0A07:09:20.647 STDOUT [aws] terraform:       + id     = (known after apply)%0A07:09:20.647 STDOUT [aws] terraform:       + region = "ap-northeast-1"%0A07:09:20.647 STDOUT [aws] terraform:       + rule {%0A07:09:20.647 STDOUT [aws] terraform:           + apply_server_side_encryption_by_default {%0A07:09:20.647 STDOUT [aws] terraform:               + kms_master_key_id = (known after apply)%0A07:09:20.647 STDOUT [aws] terraform:               + sse_algorithm     = "aws:kms"%0A07:09:20.647 STDOUT [aws] terraform:             }%0A07:09:20.647 STDOUT [aws] terraform:         }%0A07:09:20.648 STDOUT [aws] terraform:     }%0A07:09:20.648 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_versioning.this will be created%0A07:09:20.648 STDOUT [aws] terraform:   + resource "aws_s3_bucket_versioning" "this" {%0A07:09:20.648 STDOUT [aws] terraform:       + bucket = (known after apply)%0A07:09:20.648 STDOUT [aws] terraform:       + id     = (known after apply)%0A07:09:20.648 STDOUT [aws] terraform:       + region = "ap-northeast-1"%0A07:09:20.648 STDOUT [aws] terraform:       + versioning_configuration {%0A07:09:20.648 STDOUT [aws] terraform:           + mfa_delete = (known after apply)%0A07:09:20.648 STDOUT [aws] terraform:           + status     = "Enabled"%0A07:09:20.648 STDOUT [aws] terraform:         }%0A07:09:20.648 STDOUT [aws] terraform:     }%0A07:09:20.648 STDOUT [aws] terraform:   # module.openmetadata_s3.terraform_data.copy_docker_environments will be created%0A07:09:20.648 STDOUT [aws] terraform:   + resource "terraform_data" "copy_docker_environments" {%0A07:09:20.648 STDOUT [aws] terraform:       + id               = (known after apply)%0A07:09:20.648 STDOUT [aws] terraform:       + triggers_replace = [%0A07:09:20.648 STDOUT [aws] terraform:           + (known after apply),%0A07:09:20.648 STDOUT [aws] terraform:           + "3a92284b199950bde811c42a9dbf742b0622d3d70b59ab164a74db55e4de5b5e",%0A07:09:20.648 STDOUT [aws] terraform:           + "dea6d017571d8236509550f0186053222ac0478072605cf61b9a400823558ad4",%0A07:09:20.649 STDOUT [aws] terraform:           + "dea6d017571d8236509550f0186053222ac0478072605cf61b9a400823558ad4",%0A07:09:20.649 STDOUT [aws] terraform:           + "fb3d53fd55bd99861e690d6e6daa2cc288e644c34ff31307a7a64ec0addc73af",%0A07:09:20.649 STDOUT [aws] terraform:         ]%0A07:09:20.649 STDOUT [aws] terraform:     }%0A07:09:20.649 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret.aurora will be created%0A07:09:20.649 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret" "aurora" {%0A07:09:20.649 STDOUT [aws] terraform:       + arn                            = (known after apply)%0A07:09:20.649 STDOUT [aws] terraform:       + force_overwrite_replica_secret = false%0A07:09:20.649 STDOUT [aws] terraform:       + id                             = (known after apply)%0A07:09:20.649 STDOUT [aws] terraform:       + name                           = "ethan-dev-secret-apne1-aurora"%0A07:09:20.649 STDOUT [aws] terraform:       + name_prefix                    = (known after apply)%0A07:09:20.649 STDOUT [aws] terraform:       + policy                         = (known after apply)%0A07:09:20.649 STDOUT [aws] terraform:       + recovery_window_in_days        = 30%0A07:09:20.649 STDOUT [aws] terraform:       + region                         = "ap-northeast-1"%0A07:09:20.649 STDOUT [aws] terraform:       + tags                           = {%0A07:09:20.650 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-aurora"%0A07:09:20.650 STDOUT [aws] terraform:         }%0A07:09:20.650 STDOUT [aws] terraform:       + tags_all                       = {%0A07:09:20.650 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-aurora"%0A07:09:20.650 STDOUT [aws] terraform:         }%0A07:09:20.650 STDOUT [aws] terraform:         # (1 unchanged attribute hidden)%0A07:09:20.650 STDOUT [aws] terraform:       + replica (known after apply)%0A07:09:20.650 STDOUT [aws] terraform:     }%0A07:09:20.650 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret.openmetadata will be created%0A07:09:20.650 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret" "openmetadata" {%0A07:09:20.650 STDOUT [aws] terraform:       + arn                            = (known after apply)%0A07:09:20.650 STDOUT [aws] terraform:       + description                    = "List of initial user passwords required when building OpenMetadata"%0A07:09:20.650 STDOUT [aws] terraform:       + force_overwrite_replica_secret = false%0A07:09:20.650 STDOUT [aws] terraform:       + id                             = (known after apply)%0A07:09:20.650 STDOUT [aws] terraform:       + name                           = "ethan-dev-secret-apne1-openmetadata"%0A07:09:20.650 STDOUT [aws] terraform:       + name_prefix                    = (known after apply)%0A07:09:20.650 STDOUT [aws] terraform:       + policy                         = (known after apply)%0A07:09:20.651 STDOUT [aws] terraform:       + recovery_window_in_days        = 30%0A07:09:20.651 STDOUT [aws] terraform:       + region                         = "ap-northeast-1"%0A07:09:20.651 STDOUT [aws] terraform:       + tags                           = {%0A07:09:20.651 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-openmetadata"%0A07:09:20.651 STDOUT [aws] terraform:         }%0A07:09:20.651 STDOUT [aws] terraform:       + tags_all                       = {%0A07:09:20.651 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-openmetadata"%0A07:09:20.651 STDOUT [aws] terraform:         }%0A07:09:20.651 STDOUT [aws] terraform:       + replica (known after apply)%0A07:09:20.651 STDOUT [aws] terraform:     }%0A07:09:20.651 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret_version.aurora will be created%0A07:09:20.651 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret_version" "aurora" {%0A07:09:20.651 STDOUT [aws] terraform:       + arn                  = (known after apply)%0A07:09:20.651 STDOUT [aws] terraform:       + has_secret_string_wo = (known after apply)%0A07:09:20.651 STDOUT [aws] terraform:       + id                   = (known after apply)%0A07:09:20.651 STDOUT [aws] terraform:       + region               = "ap-northeast-1"%0A07:09:20.651 STDOUT [aws] terraform:       + secret_id            = (known after apply)%0A07:09:20.651 STDOUT [aws] terraform:       + secret_string        = (sensitive value)%0A07:09:20.652 STDOUT [aws] terraform:       + secret_string_wo     = (write-only attribute)%0A07:09:20.652 STDOUT [aws] terraform:       + version_id           = (known after apply)%0A07:09:20.652 STDOUT [aws] terraform:       + version_stages       = (known after apply)%0A07:09:20.652 STDOUT [aws] terraform:     }%0A07:09:20.652 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret_version.openmetadata will be created%0A07:09:20.652 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret_version" "openmetadata" {%0A07:09:20.652 STDOUT [aws] terraform:       + arn                  = (known after apply)%0A07:09:20.652 STDOUT [aws] terraform:       + has_secret_string_wo = (known after apply)%0A07:09:20.652 STDOUT [aws] terraform:       + id                   = (known after apply)%0A07:09:20.652 STDOUT [aws] terraform:       + region               = "ap-northeast-1"%0A07:09:20.652 STDOUT [aws] terraform:       + secret_id            = (known after apply)%0A07:09:20.652 STDOUT [aws] terraform:       + secret_string        = (sensitive value)%0A07:09:20.652 STDOUT [aws] terraform:       + secret_string_wo     = (write-only attribute)%0A07:09:20.652 STDOUT [aws] terraform:       + version_id           = (known after apply)%0A07:09:20.652 STDOUT [aws] terraform:       + version_stages       = (known after apply)%0A07:09:20.653 STDOUT [aws] terraform:     }%0A07:09:20.653 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.airflow_admin_password will be created%0A07:09:20.653 STDOUT [aws] terraform:   + resource "random_password" "airflow_admin_password" {%0A07:09:20.653 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)%0A07:09:20.653 STDOUT [aws] terraform:       + id          = (known after apply)%0A07:09:20.653 STDOUT [aws] terraform:       + length      = 16%0A07:09:20.653 STDOUT [aws] terraform:       + lower       = true%0A07:09:20.653 STDOUT [aws] terraform:       + min_lower   = 0%0A07:09:20.653 STDOUT [aws] terraform:       + min_numeric = 0%0A07:09:20.653 STDOUT [aws] terraform:       + min_special = 0%0A07:09:20.653 STDOUT [aws] terraform:       + min_upper   = 0%0A07:09:20.653 STDOUT [aws] terraform:       + number      = true%0A07:09:20.653 STDOUT [aws] terraform:       + numeric     = true%0A07:09:20.653 STDOUT [aws] terraform:       + result      = (sensitive value)%0A07:09:20.653 STDOUT [aws] terraform:       + special     = false%0A07:09:20.653 STDOUT [aws] terraform:       + upper       = true%0A07:09:20.653 STDOUT [aws] terraform:     }%0A07:09:20.653 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.airflow_db_password will be created%0A07:09:20.653 STDOUT [aws] terraform:   + resource "random_password" "airflow_db_password" {%0A07:09:20.653 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)%0A07:09:20.653 STDOUT [aws] terraform:       + id          = (known after apply)%0A07:09:20.653 STDOUT [aws] terraform:       + length      = 16%0A07:09:20.654 STDOUT [aws] terraform:       + lower       = true%0A07:09:20.654 STDOUT [aws] terraform:       + min_lower   = 0%0A07:09:20.654 STDOUT [aws] terraform:       + min_numeric = 0%0A07:09:20.654 STDOUT [aws] terraform:       + min_special = 0%0A07:09:20.654 STDOUT [aws] terraform:       + min_upper   = 0%0A07:09:20.654 STDOUT [aws] terraform:       + number      = true%0A07:09:20.654 STDOUT [aws] terraform:       + numeric     = true%0A07:09:20.654 STDOUT [aws] terraform:       + result      = (sensitive value)%0A07:09:20.654 STDOUT [aws] terraform:       + special     = false%0A07:09:20.654 STDOUT [aws] terraform:       + upper       = true%0A07:09:20.654 STDOUT [aws] terraform:     }%0A07:09:20.654 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.aurora_password will be created%0A07:09:20.654 STDOUT [aws] terraform:   + resource "random_password" "aurora_password" {%0A07:09:20.654 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)%0A07:09:20.654 STDOUT [aws] terraform:       + id          = (known after apply)%0A07:09:20.654 STDOUT [aws] terraform:       + length      = 16%0A07:09:20.654 STDOUT [aws] terraform:       + lower       = true%0A07:09:20.654 STDOUT [aws] terraform:       + min_lower   = 0%0A07:09:20.654 STDOUT [aws] terraform:       + min_numeric = 0%0A07:09:20.654 STDOUT [aws] terraform:       + min_special = 0%0A07:09:20.654 STDOUT [aws] terraform:       + min_upper   = 0%0A07:09:20.654 STDOUT [aws] terraform:       + number      = true%0A07:09:20.654 STDOUT [aws] terraform:       + numeric     = true%0A07:09:20.655 STDOUT [aws] terraform:       + result      = (sensitive value)%0A07:09:20.655 STDOUT [aws] terraform:       + special     = false%0A07:09:20.655 STDOUT [aws] terraform:       + upper       = true%0A07:09:20.655 STDOUT [aws] terraform:     }%0A07:09:20.655 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.elasticsearch_password will be created%0A07:09:20.655 STDOUT [aws] terraform:   + resource "random_password" "elasticsearch_password" {%0A07:09:20.655 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)%0A07:09:20.655 STDOUT [aws] terraform:       + id          = (known after apply)%0A07:09:20.655 STDOUT [aws] terraform:       + length      = 16%0A07:09:20.655 STDOUT [aws] terraform:       + lower       = true%0A07:09:20.655 STDOUT [aws] terraform:       + min_lower   = 0%0A07:09:20.655 STDOUT [aws] terraform:       + min_numeric = 0%0A07:09:20.655 STDOUT [aws] terraform:       + min_special = 0%0A07:09:20.655 STDOUT [aws] terraform:       + min_upper   = 0%0A07:09:20.655 STDOUT [aws] terraform:       + number      = true%0A07:09:20.655 STDOUT [aws] terraform:       + numeric     = true%0A07:09:20.655 STDOUT [aws] terraform:       + result      = (sensitive value)%0A07:09:20.655 STDOUT [aws] terraform:       + special     = false%0A07:09:20.655 STDOUT [aws] terraform:       + upper       = true%0A07:09:20.655 STDOUT [aws] terraform:     }%0A07:09:20.655 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.openmetadata_db_password will be created%0A07:09:20.655 STDOUT [aws] terraform:   + resource "random_password" "openmetadata_db_password" {%0A07:09:20.656 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)%0A07:09:20.656 STDOUT [aws] terraform:       + id          = (known after apply)%0A07:09:20.656 STDOUT [aws] terraform:       + length      = 16%0A07:09:20.656 STDOUT [aws] terraform:       + lower       = true%0A07:09:20.656 STDOUT [aws] terraform:       + min_lower   = 0%0A07:09:20.656 STDOUT [aws] terraform:       + min_numeric = 0%0A07:09:20.656 STDOUT [aws] terraform:       + min_special = 0%0A07:09:20.656 STDOUT [aws] terraform:       + min_upper   = 0%0A07:09:20.656 STDOUT [aws] terraform:       + number      = true%0A07:09:20.656 STDOUT [aws] terraform:       + numeric     = true%0A07:09:20.656 STDOUT [aws] terraform:       + result      = (sensitive value)%0A07:09:20.656 STDOUT [aws] terraform:       + special     = false%0A07:09:20.656 STDOUT [aws] terraform:       + upper       = true%0A07:09:20.656 STDOUT [aws] terraform:     }%0A07:09:20.656 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_ec2_managed_prefix_list.allowed_ip_list will be created%0A07:09:20.656 STDOUT [aws] terraform:   + resource "aws_ec2_managed_prefix_list" "allowed_ip_list" {%0A07:09:20.656 STDOUT [aws] terraform:       + address_family = "IPv4"%0A07:09:20.656 STDOUT [aws] terraform:       + arn            = (known after apply)%0A07:09:20.656 STDOUT [aws] terraform:       + id             = (known after apply)%0A07:09:20.656 STDOUT [aws] terraform:       + max_entries    = 30%0A07:09:20.656 STDOUT [aws] terraform:       + name           = "allowed_ip_list"%0A07:09:20.657 STDOUT [aws] terraform:       + owner_id       = (known after apply)%0A07:09:20.657 STDOUT [aws] terraform:       + region         = "ap-northeast-1"%0A07:09:20.657 STDOUT [aws] terraform:       + tags_all       = (known after apply)%0A07:09:20.657 STDOUT [aws] terraform:       + version        = (known after apply)%0A07:09:20.657 STDOUT [aws] terraform:       + entry {%0A07:09:20.657 STDOUT [aws] terraform:           + cidr        = "192.0.2.0/24"%0A07:09:20.657 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)%0A07:09:20.657 STDOUT [aws] terraform:         }%0A07:09:20.657 STDOUT [aws] terraform:     }%0A07:09:20.657 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.alb_sg will be created%0A07:09:20.657 STDOUT [aws] terraform:   + resource "aws_security_group" "alb_sg" {%0A07:09:20.657 STDOUT [aws] terraform:       + arn                    = (known after apply)%0A07:09:20.657 STDOUT [aws] terraform:       + description            = "Managed by Terraform"%0A07:09:20.657 STDOUT [aws] terraform:       + egress                 = [%0A07:09:20.657 STDOUT [aws] terraform:           + {%0A07:09:20.657 STDOUT [aws] terraform:               + cidr_blocks      = [%0A07:09:20.657 STDOUT [aws] terraform:                   + "0.0.0.0/0",%0A07:09:20.657 STDOUT [aws] terraform:                 ]%0A07:09:20.657 STDOUT [aws] terraform:               + from_port        = 0%0A07:09:20.658 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []%0A07:09:20.658 STDOUT [aws] terraform:               + prefix_list_ids  = []%0A07:09:20.658 STDOUT [aws] terraform:               + protocol         = "-1"%0A07:09:20.658 STDOUT [aws] terraform:               + security_groups  = []%0A07:09:20.658 STDOUT [aws] terraform:               + self             = false%0A07:09:20.658 STDOUT [aws] terraform:               + to_port          = 0%0A07:09:20.658 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)%0A07:09:20.658 STDOUT [aws] terraform:             },%0A07:09:20.658 STDOUT [aws] terraform:         ]%0A07:09:20.658 STDOUT [aws] terraform:       + id                     = (known after apply)%0A07:09:20.658 STDOUT [aws] terraform:       + ingress                = [%0A07:09:20.658 STDOUT [aws] terraform:           + {%0A07:09:20.658 STDOUT [aws] terraform:               + cidr_blocks      = []%0A07:09:20.658 STDOUT [aws] terraform:               + from_port        = 443%0A07:09:20.658 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []%0A07:09:20.658 STDOUT [aws] terraform:               + prefix_list_ids  = (known after apply)%0A07:09:20.659 STDOUT [aws] terraform:               + protocol         = "tcp"%0A07:09:20.659 STDOUT [aws] terraform:               + security_groups  = []%0A07:09:20.659 STDOUT [aws] terraform:               + self             = false%0A07:09:20.659 STDOUT [aws] terraform:               + to_port          = 443%0A07:09:20.659 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)%0A07:09:20.659 STDOUT [aws] terraform:             },%0A07:09:20.659 STDOUT [aws] terraform:         ]%0A07:09:20.659 STDOUT [aws] terraform:       + name                   = (known after apply)%0A07:09:20.659 STDOUT [aws] terraform:       + name_prefix            = (known after apply)%0A07:09:20.659 STDOUT [aws] terraform:       + owner_id               = (known after apply)%0A07:09:20.659 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"%0A07:09:20.659 STDOUT [aws] terraform:       + revoke_rules_on_delete = false%0A07:09:20.659 STDOUT [aws] terraform:       + tags                   = {%0A07:09:20.659 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-alb"%0A07:09:20.659 STDOUT [aws] terraform:         }%0A07:09:20.659 STDOUT [aws] terraform:       + tags_all               = {%0A07:09:20.659 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-alb"%0A07:09:20.659 STDOUT [aws] terraform:         }%0A07:09:20.659 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)%0A07:09:20.660 STDOUT [aws] terraform:     }%0A07:09:20.660 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.aurora_sg will be created%0A07:09:20.660 STDOUT [aws] terraform:   + resource "aws_security_group" "aurora_sg" {%0A07:09:20.660 STDOUT [aws] terraform:       + arn                    = (known after apply)%0A07:09:20.660 STDOUT [aws] terraform:       + description            = "Managed by Terraform"%0A07:09:20.660 STDOUT [aws] terraform:       + egress                 = [%0A07:09:20.660 STDOUT [aws] terraform:           + {%0A07:09:20.660 STDOUT [aws] terraform:               + cidr_blocks      = [%0A07:09:20.660 STDOUT [aws] terraform:                   + "0.0.0.0/0",%0A07:09:20.660 STDOUT [aws] terraform:                 ]%0A07:09:20.660 STDOUT [aws] terraform:               + from_port        = 0%0A07:09:20.660 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []%0A07:09:20.660 STDOUT [aws] terraform:               + prefix_list_ids  = []%0A07:09:20.660 STDOUT [aws] terraform:               + protocol         = "-1"%0A07:09:20.660 STDOUT [aws] terraform:               + security_groups  = []%0A07:09:20.660 STDOUT [aws] terraform:               + self             = false%0A07:09:20.660 STDOUT [aws] terraform:               + to_port          = 0%0A07:09:20.660 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)%0A07:09:20.660 STDOUT [aws] terraform:             },%0A07:09:20.660 STDOUT [aws] terraform:         ]%0A07:09:20.661 STDOUT [aws] terraform:       + id                     = (known after apply)%0A07:09:20.661 STDOUT [aws] terraform:       + ingress                = [%0A07:09:20.661 STDOUT [aws] terraform:           + {%0A07:09:20.661 STDOUT [aws] terraform:               + cidr_blocks      = []%0A07:09:20.661 STDOUT [aws] terraform:               + from_port        = 5432%0A07:09:20.661 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []%0A07:09:20.661 STDOUT [aws] terraform:               + prefix_list_ids  = []%0A07:09:20.661 STDOUT [aws] terraform:               + protocol         = "tcp"%0A07:09:20.661 STDOUT [aws] terraform:               + security_groups  = (known after apply)%0A07:09:20.661 STDOUT [aws] terraform:               + self             = false%0A07:09:20.661 STDOUT [aws] terraform:               + to_port          = 5432%0A07:09:20.661 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)%0A07:09:20.661 STDOUT [aws] terraform:             },%0A07:09:20.661 STDOUT [aws] terraform:         ]%0A07:09:20.661 STDOUT [aws] terraform:       + name                   = (known after apply)%0A07:09:20.661 STDOUT [aws] terraform:       + name_prefix            = (known after apply)%0A07:09:20.661 STDOUT [aws] terraform:       + owner_id               = (known after apply)%0A07:09:20.661 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"%0A07:09:20.661 STDOUT [aws] terraform:       + revoke_rules_on_delete = false%0A07:09:20.662 STDOUT [aws] terraform:       + tags                   = {%0A07:09:20.662 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-aurora"%0A07:09:20.662 STDOUT [aws] terraform:         }%0A07:09:20.662 STDOUT [aws] terraform:       + tags_all               = {%0A07:09:20.662 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-aurora"%0A07:09:20.662 STDOUT [aws] terraform:         }%0A07:09:20.662 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)%0A07:09:20.662 STDOUT [aws] terraform:     }%0A07:09:20.662 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.ecs_sg will be created%0A07:09:20.662 STDOUT [aws] terraform:   + resource "aws_security_group" "ecs_sg" {%0A07:09:20.662 STDOUT [aws] terraform:       + arn                    = (known after apply)%0A07:09:20.662 STDOUT [aws] terraform:       + description            = "Managed by Terraform"%0A07:09:20.662 STDOUT [aws] terraform:       + egress                 = [%0A07:09:20.662 STDOUT [aws] terraform:           + {%0A07:09:20.662 STDOUT [aws] terraform:               + cidr_blocks      = [%0A07:09:20.662 STDOUT [aws] terraform:                   + "0.0.0.0/0",%0A07:09:20.662 STDOUT [aws] terraform:                 ]%0A07:09:20.662 STDOUT [aws] terraform:               + from_port        = 0%0A07:09:20.662 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []%0A07:09:20.662 STDOUT [aws] terraform:               + prefix_list_ids  = []%0A07:09:20.663 STDOUT [aws] terraform:               + protocol         = "-1"%0A07:09:20.663 STDOUT [aws] terraform:               + security_groups  = []%0A07:09:20.663 STDOUT [aws] terraform:               + self             = false%0A07:09:20.663 STDOUT [aws] terraform:               + to_port          = 0%0A07:09:20.663 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)%0A07:09:20.663 STDOUT [aws] terraform:             },%0A07:09:20.663 STDOUT [aws] terraform:         ]%0A07:09:20.663 STDOUT [aws] terraform:       + id                     = (known after apply)%0A07:09:20.663 STDOUT [aws] terraform:       + ingress                = [%0A07:09:20.663 STDOUT [aws] terraform:           + {%0A07:09:20.663 STDOUT [aws] terraform:               + cidr_blocks      = []%0A07:09:20.663 STDOUT [aws] terraform:               + from_port        = 8585%0A07:09:20.663 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []%0A07:09:20.663 STDOUT [aws] terraform:               + prefix_list_ids  = []%0A07:09:20.663 STDOUT [aws] terraform:               + protocol         = "tcp"%0A07:09:20.663 STDOUT [aws] terraform:               + security_groups  = (known after apply)%0A07:09:20.663 STDOUT [aws] terraform:               + self             = false%0A07:09:20.663 STDOUT [aws] terraform:               + to_port          = 8585%0A07:09:20.663 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)%0A07:09:20.664 STDOUT [aws] terraform:             },%0A07:09:20.664 STDOUT [aws] terraform:         ]%0A07:09:20.664 STDOUT [aws] terraform:       + name                   = (known after apply)%0A07:09:20.664 STDOUT [aws] terraform:       + name_prefix            = (known after apply)%0A07:09:20.664 STDOUT [aws] terraform:       + owner_id               = (known after apply)%0A07:09:20.664 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"%0A07:09:20.664 STDOUT [aws] terraform:       + revoke_rules_on_delete = false%0A07:09:20.664 STDOUT [aws] terraform:       + tags                   = {%0A07:09:20.664 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-ecs"%0A07:09:20.664 STDOUT [aws] terraform:         }%0A07:09:20.664 STDOUT [aws] terraform:       + tags_all               = {%0A07:09:20.664 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-ecs"%0A07:09:20.664 STDOUT [aws] terraform:         }%0A07:09:20.664 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)%0A07:09:20.664 STDOUT [aws] terraform:     }%0A07:09:20.664 STDOUT [aws] terraform: Plan: 77 to add, 0 to change, 0 to destroy.%0A07:09:20.664 STDOUT [aws] terraform: 
```
</details>

<!-- Sticky Pull Request Commentterragrunt-plan -->